{"resourceLocationId":-2147483563,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Newcastle Island Marine","fullName":"Saysutshun (Newcastle Island Marine) Provincial Park","description":"For an experience rich in history, culture and entertainment, do what people have been doing since the 1930s - hop a boat to Newcastle Island Marine Provincial Park, one of the most intriguing parks in BC. Bring your own boat or take the passenger ferry from Nanaimo - a 10 minute ride that deposits passengers on Newcastle Island, located just a few hundred meters offshore from Vancouver Island. From a distance you'll see an island shoreline dominated by steep sandstone cliffs and ledges, interspersed with sunny beaches. Up close, you'll discover rocky caves and caverns - a marked contrast to the interior of the island, which is studded with mature Douglas fir, Garry oak, arbutus and dogwood trees.","drivingDirections":"Newcastle Island is accessible by boat only. Once you've reached Nanaimo (mainland visitors can ferry over via Horseshoe Bay), take the foot passenger ferry for the 10 minute ride from Maffeo-Sutton Park, just north of downtown Nanaimo on Hwy 1.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/parks/saysutshun/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483543,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648,-2147483644]},{"resourceLocationId":-2147483526,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Strathcona Backcountry","fullName":"Strathcona Backcountry","description":"","drivingDirections":"","confirmationLetterPolicies":[]}],"email":"","website":"","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483482,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483641]},{"resourceLocationId":-2147483510,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"West Lake","fullName":"West Lake Provincial Park","description":"West Lake is a day-use park where visitors can enjoy fishing, boating, swimming, and hiking and, in the winter, cross-country skiing and tobogganing. A boaters beach complete with picnic tables, pit toilets and fire pits has been developed for boaters and water skiers. A swimming area is sectioned off. There is a volleyball net and horseshoe pit in the main day-use area. A group picnic site (capacity 100) with pit toilets and a picnic shelter with wood stove, horseshoe pits, fire circle and play field is available.","drivingDirections":"West Lake Provincial Park is located 22 km southwest of Prince George on the Blackwater Road on the north shore of West Lake.","confirmationLetterPolicies":[]}],"email":"","website":"https://wwwd.bcparks.ca/explore/parkpgs/west_lk/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483446,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483640]},{"resourceLocationId":-2147483511,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Wells Gray - Murtle Lake","fullName":"Wells Gray Provincial Park - Murtle Lake","description":"<p>Murtle Lake   There are 69 sites.<font color=\"red\">  No internal combustion engines or electric motors on this lake.</font> </p>\n          <p>For your safety, please fill out a registration form, with your name and the colour of your canoe or kayak, upon arriving at the park. Please add a copy of your camping permit to the envelope. You also need to carry a copy of the permit on your body, while you are in the park (print 2 copies and bring them with you).</p>","drivingDirections":"Murtle Lake is accessed off highway #5 at Blue River. Drive 27 km west on a winding, narrow, gravel road to the parking lot. From there, a 2.5 km level trail (canoe-cart accessible) leads to the canoe launch.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/explore/parkpgs/wells_gry/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483455,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483641]},{"resourceLocationId":-2147483648,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Akamina Kishinena","fullName":"Akamina-Kishinena Provincial Park","description":"Akamina Creek Campground has 10 tent pads, an outhouse and a food cache. This campground is located just off the main trail 0.9 km from Akamina Pass and 2.4 km from the Akamina Pass Trailhead. Winter camping is available year round at Akamina Creek Campground.","drivingDirections":"From Hwy 3 turn south at Pincher Creek onto Hwy 6. It is 48km to Waterton Lakes National Park. From the park gate access the Cameron Lake park road to reach the Akamina Pass trailhead (16 km). A 30 minute, 1.5 km uphill walk reaches the boundary between Alberta and BC and the eastern border of Akamina-Kishinena Provincial Park. The closest communities are Waterton Lakes National Park community and Sparwood.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/akamina-kishinena-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483648,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483641]},{"resourceLocationId":-2147483647,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Alice Lake","fullName":"Alice Lake Provincial Park","description":"Alice Lake is surrounded by towering mountains, dense forests and grassy areas. There are four fresh water lakes which dominate the landscape and make swimming and fishing very enjoyable pastimes. The trail around Alice Lake is a popular one for an evening stroll and, for the more adventurous, there is the Four Lakes Trail. There are excellent views of the Squamish River and the Tantalus Range from the DeBeck's Hill Trail. This is a favourite family park.","drivingDirections":"Situated off Highway 99, approximately 13 km north of Squamish, 71 km north of Lions Gate Bridge in North Vancouver.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/alice-lake-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483647,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648,-2147483644]},{"resourceLocationId":-2147483497,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Allison Lake","fullName":"Allison Lake Provincial Park","description":"Off the beaten track, you’ll find tree-bordered Allison Lake, a great spot for swimmers and those who love to fish. The park is known for its spectacular stands of aspen that burst into golden colours in the fall.","drivingDirections":"28 km north of Princeton, along Hwy # 5A. The closest community, town or city is Princeton.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/allison-lake-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483434,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648]},{"resourceLocationId":-2147483646,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Bamberton","fullName":"Bamberton Provincial Park","description":"The park is very popular in the summer months, and can be busy as well in June, when a number of nearby schools make field trips to study the intertidal life on the beach. With Victoria just a 30-minute drive south over the scenic Malahat Drive, Bamberton is within easy reach of many tourist attractions. You can also hop on the Mill Bay ferry for the 25-minute trip to Brentwood Bay and visit the world-renowned Butchart Gardens.","drivingDirections":"The park is located on southern Vancouver Island, approximately 45 km north of Victoria off Highway 1. Turn east off Highway 1 onto Mill Bay Road, near the north end of the scenic Malahat Drive. BC Ferries offers service from Mill Bay to Brentwood Bay, a distance of 8 km by sea with a crossing time of 25 minutes. Bamberton Park is located a 5-minute drive south of Mill Bay. Nearby communities include: Mill Bay, Shawnigan Lake, Cobble Hill, Duncan, Victoria.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/bamberton-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483645,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648]},{"resourceLocationId":-2147483645,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Bear Creek","fullName":"Bear Creek Provincial Park","description":"Truly a natural wonderland, Bear Creek Provincial Park is situated in the Central Okanagan Basin on the west side of Okanagan Lake. The park features lakeside camping, over 400 metres of sandy beaches and 5 km of spectacular, well-marked hiking trails. A picturesque canyon has been carved into the bedrock by Bear Creek tumbling onto a cottonwood-lined delta. This park is extremely busy during the summer season and reservations are recommended. For your convenience, during the summer season the park has a concession located at the gatehouse and managed by the Park Facility Operator.","drivingDirections":"The park is located on Westside Road, 9 km off Highway 97, west of Kelowna. From Highway 97, travelling south, leave the city of Kelowna, cross floating bridge on Highway 97 out of Kelowna, travel 2 km and turn west onto Westside Road at the main intersection and follow for 7 km. The entrance to the park is just past the bridge over the Lambly (Bear) Creek. The closest community, towns and cities are Kelowna, Westbank and small housing developments on Westside Road.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/bear-creek-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483644,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648,-2147483647]},{"resourceLocationId":-2147483644,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Beatton","fullName":"Beatton Provincial Park","description":"Beatton Provincial Park is a year round recreational facility located on the shores of Charlie Lake. This 320 hectare park is a popular summer recreation destination for swimming, fishing and hiking. Beatton also offers excellent winter recreation opportunities. Experience 12 km of groomed cross-country ski trails designed for novice, intermediate and advanced skiing. Visitors have a good chance of seeing deer or moose which frequent the park during the winter.","drivingDirections":"This park is located 13 km northwest of Fort St. John off Highway 97 on the 244 road, approximately a 20 minute drive.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/beatton-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483643,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648,-2147483640]},{"resourceLocationId":-2147483643,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Beaumont","fullName":"Beaumont Provincial Park","description":"Beaumont Provincial Park lies within the Nechako Plateau bordered to the west and north by the Hazelton, Skeena and Omineca mountains. The park offers a beautiful, sandy beach for swimming and sunbathing and a variety of facilities for water-oriented activities enhance visitor enjoyment.","drivingDirections":"A 134 km drive west of Prince George on Highway 16. The area is characterized by gently rolling terrain forested with willow, poplar, birch, spruce and occasional stands of aspen. The closest communities, towns and cities are Vanderhoof, Fraser Lake and Fort Fraser.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/beaumont-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483642,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648]},{"resourceLocationId":-2147483641,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Big Bar Lake","fullName":"Big Bar Lake Provincial Park","description":"Big Bar Lake Provincial Park comprises approximately 330 hectares of rolling landscape situated on the shore of a large lake, and scattered with small lakes and ponds. The park is couched in typical Cariboo ranching country on the southern edge of the Fraser Plateau. This extensive plateau stretches north beyond Lac La Hache, and was formed from lava flows some five to ten million years ago. The park was established in 1969, and is a very popular destination for family camping vacations. The park features 25 new lakeside campsites in addition to a large day-use area offering beachside picnic areas and a Big Toy for children. The construction project was funded by FRBC through the Campgrounds BC Initiative, and was completed in the summer of 1999.","drivingDirections":"The park is located approximately 42 km northwest of Clinton. It is easily accessible via Highway 97 to approximately 8 km north of Clinton, and then via gravel road for a distance of about 34 km. For map information, please refer to topographical map number: 1:50,000 92P-15.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/big-bar-lake-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483640,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648]},{"resourceLocationId":-2147483640,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Birkenhead Lake","fullName":"Birkenhead Lake Provincial Park","description":"Birkenhead Lake Provincial Park was first established in 1963 to provide lakeside camping and other recreation experiences for travellers between Whistler and Lillooet. The park was expanded in 1996 from 3,642 hectares to 9,755 hectares, adding significant conservation values of the Sockeye Creek watershed. The park was again expanded by 684 hectares in 2008 to include more of the alpine headwaters of the western side of the Sockeye Creek watershed.\nThe park protects important habitat for a variety of wildlife, including spotted owls, mountain goats, black bears and grizzly bears. Old growth forests, subalpine and alpine environments, large and small lakes all contribute to the park's diversity.","drivingDirections":"Located 22 km West of D'arcy. 90 km North of Whistler, 145 km North of Squamish. Take Highway 99 from Pemberton northeast to Mt. Currie, turn off Highway 99 to D'arcy. Just before D'arcy (about 50km from Mt. Currie) there are highway signs indicating a turn off on to a gravel road that leads to Birkenhead Lake. From there it is a 17 km drive along a gravel road. The nearest communities, towns and cities are D'arcy, Pemberton and Mt Currie.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/birkenhead-lake-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483639,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648]},{"resourceLocationId":-2147483639,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Blanket Creek","fullName":"Blanket Creek Provincial Park","description":"Blanket Creek Provincial Park is a good family holiday destination just south of Revelstoke. Popular with local residents, this park was originally a farm now developed to provide recreational opportunities. It is one of a system of four provincial parks on the Arrow Lake Reservoir. With its warm man-made swimming lagoon, adventure playground, historic homestead site and easy access to scenic Sutherland Falls, this park offers enjoyment for the entire family.\nBlanket Creek Park makes a great staging area for other recreational explorations. Mount Revelstoke and Glacier National Parks both close by, offer hiking trails for all skill levels. Travel south, take a ferry ride and discover Nakusp Hot Springs. The variety of opportunities both in and around this park beckons recreationists of all ages.","drivingDirections":"Located in the southern interior of BC, a 15-minute drive, 25 km south of Revelstoke on Hwy 23, where Blanket Creek flows into the Columbia River just north of the Upper Arrow Lake.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/blanket-creek-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483638,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648,-2147483644]},{"resourceLocationId":-2147483638,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Bowron Lake","fullName":"Bowron Lake Provincial Park","description":"Bowron Lake Park is a large wilderness area situated on the western slopes of the Cariboo Mountain Range. The world-renowned Bowron Lake Canoe Circuit encompasses a 116 km chain of lakes, waterways and connecting portages. The full circuit will take 6 to 10 days to complete, depending on your time frame and skill level. For those looking for a shorter trip, the west side of the circuit can be paddled in 2 to 4 days. It is recommended that those who attempt the circuit have some wilderness canoeing experience.","drivingDirections":"Drive north on Highway 97 through Quesnel, then follow signs onto Highway 26, which leads through Wells. Approximately 1 km before the historic townsite of Barkerville, turn left onto the Bowron Lake Road. From there it's another 27 km to the park entrance on a wide, well-graded dirt road where a 25 unit frontcountry campground and the 116 km wilderness canoe circuit are located. Bowron Lake Park is located about 120 kilometers east of Quesnel.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/bowron-lake-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483637,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648,-2147483632,-2147483631]},{"resourceLocationId":-2147483636,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Bromley Rock","fullName":"Bromley Rock Provincial Park","description":"A striking rock bluff along the Similkameen River provides a focus for this tiny park. Swimmers can enjoy a refreshing dip in a quiet pool.  The campsites are located in a pleasantly-forested site along the Similkameen River. Hiking in the area affords good views of the Similkameen Valley. Tubing is also popular here giving a downstream route to Stemwinder Provincial Park.","drivingDirections":"The park is located 21 km east of Princeton, on Hwy 3. The nearest community, town or city is Princeton.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/bromley-rock-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483635,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648]},{"resourceLocationId":-2147483635,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Bugaboo","fullName":"Bugaboo - Backcountry Camping","description":"Backcountry campgrounds are provided at Boulder Camp below the Conrad Kain Hut and on the bare rock slabs of Applebee Dome, 1km above the Conrad Kain Hut. A per-person fee is in effect at these campgrounds. To prevent contamination of the water supply and damage to the sensitive alpine environment, camping in the park is not permitted elsewhere in the vicinity of the main spires (Bugaboo, Snowpatch, Crescent, Pigeon, Howsers). Bivouacking is not permitted except in emergency situations. Wilderness camping is allowed in other, more remote areas of the park, such as the Vowell Group. Leave-no-trace wilderness camping ethics should be used.","drivingDirections":"Bugaboo Provincial Park is located in southeastern B.C., between Golden and Radium Hot Springs, and west of Highway 95. Access to the park is about 50km of gravel road from Hwy #95. This gravel road, which opens late spring through late fall, begins at Brisco, 27 kilometres north of Radium Hot Springs or 76 km south of Golden on Highway 95. A 4x4 is not required but a 2wd with some decent ground clearance is recommended. The last 3km section of the gravel road is rough; low-riding compact vehicles need to go slow to avoid scraping the bottom. It is recommended that visitors protect their vehicle perimeter with a portable chicken wire fence to deter porcupines and other small animals from chewing on rubber brake lines and tires. Access to the northern portions of the park via the Vowell and Malloy Creek drainages is possible by leaving Highway 95 at Spillimacheen, north of Brisco, then crossing the Columbia River and turning left on the West Side Road. After travelling 0.8 km, turn right onto Bobbie Burns Creek drainage and drive past the lodge of the same name. Logging roads up Vowell Creek and Malloy Creek lead to semi-open terrain which can be hiked into the park. The status of bridges in inactive logging areas may vary in upper drainages.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/bugaboo-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483634,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483641]},{"resourceLocationId":-2147483634,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Cape Scott","fullName":"Cape Scott Provincial Park","description":"Cape Scott Provincial Park is a truly magnificent area of rugged coastal wilderness that is located at the northwestern tip of Vancouver Island, 563 kilometres from Victoria.</p> Established in 1973 and named after the site of a lighthouse that has guided mariners since 1960, Cape Scott is characterized by more than 115 kilometres of scenic ocean frontage, including about 30 kilometres of spectacular remote beaches.</p> The park stretches from Shushartie Bay in the east, then westward around Cape Scott and south to San Josef Bay. Rocky promontories, salt marshes and jagged headlands punctuate the fine-textured, white-sand beaches. The most impressive of these beaches, Nels Bight, stretches more than 2,400 metres long and 210 metres wide at low tide, and is one of the park’s most popular camping destinations. Other significant beaches include San Josef Bay, Guise Bay, Experiment Bight, Lowrie Bay and Nissen Bight.</p> Visitors can choose between a day hike or a backpacking excursion to explore the sandy beaches, rainforests, and lowland bogs and muskeg of this wilderness park.","drivingDirections":"Cape Scott is a hike-in park, located at the northwestern tip of Vancouver Island. The only parking lot within the park, located near the southeast corner, provides easy access to the Cape Scott and San Josef Bay Trailhead. The lot, which is located 64 kilometres west of Port Hardy, can be reached by driving on a combination of public highways and private, active logging roads.</p> Port Hardy is the northern terminus of Highway 19, which connects with Vancouver Island communities south to Victoria; it is also the southern terminus of the British Columbia Ferries service to Prince Rupert. Port Hardy is also served by regularly scheduled air and bus lines. The community of Winter Harbour is another settlement southwest of the park that offers tourist amenities, RV campsites, fuel and a general store.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/cape-scott-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483632,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483641]},{"resourceLocationId":-2147483633,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Carmanah Walbran","fullName":"Carmanah Walbran Provincial Park","description":"Wilderness camping is allowed at several locations upstream from The Three Sisters in the Carmanah Valley, with walk-in camping available above the Valley where the Carmanah Valley Trailhead is located. This is the only area in the park where campfires are permitted.  Camping is also permitted during the summer months in the Valley on the Carmanah Creek’s exposed gravel bars. Campfires are prohibited here, and campers are expected to adhere to “Leave No Trace” camping practices.   Campsites with tent pads, picnic tables and fire rings are provided beyond the parking area on the service road. Short-term vehicle camping is permitted in the parking lot.","drivingDirections":"Carmanah Walbran Provincial Park is located 20 km northwest of Port Renfrew on the southwestern coast of Vancouver Island. There are three different routes leading to the Caycuse River Bridge, which is the only way to access the park. </p> Visitors traveling from Port Alberni should follow the Bamfield Road for approximately 40 km to the Franklin River Junction. At the junction, turn left onto South Main and proceed eastward, past the logging camp buildings and toward Nitinat Lake. Continue on South Main for approximately 23 km to the Nitinat River Bridge. Stay on South Main until reaching the Caycuse River Bridge. </p> Travelers from Port Renfrew should follow the Lake Cowichan Connector Road north to Honeymoon Bay. At Honeymoon Bay, turn left and proceed along South Shore Road, which becomes Nitinat Main, continuing to the junction of Nitinat Main and South Main. Turn left onto South Main and proceed to the Caycuse River Bridge. </p> Those accessing the park via Lake Cowichan should follow South Shore Road past Gordon Bay Provincial Park to the Nitinat Main, or follow the North Shore Road through Youbou to the Nitinat Main. Continue along Nitinat Main till it connects with Junction South. Turn left onto South Main and proceed to the Caycuse River Bridge. </P> Once you have crossed the Caycuse River Bridge, turn right immediately and proceed on Rosander Main for approximately 29 km to the park. </p> Communities near the park include: Port Renfrew, Port Alberni, Cowichan Lake, Duncan, and Victoria.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/carmanah-walbran-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483627,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483641]},{"resourceLocationId":-2147483632,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Carp Lake ","fullName":"Carp Lake Provincial Park","description":"Long famous for its rainbow trout, Carp Lake Provincial Park, just two hours north of Prince George and nearly in the exact centre of the province, offers some of the best fishing in the Central Interior. The park includes Carp Lake, nearby War Lake, numerous smaller lakes and streams, and the 8-kilometre waterway that connects Carp and War Lakes and forms the beginning of the McLeod River. The northern shoreline of Carp Lake has extensive sandy beaches with broad belts of sand extending up to 300 metres offshore. The sandy character of the north shore contrasts with the smooth-bouldered beaches broken by sand deltas on the spruce-forested south shore.","drivingDirections":"Carp Lake Park is two hours drive northwest of Prince George. The main access road to the park joins Highway 97 (the John Hart Highway) at the community of McLeod Lake, 141 km north of Prince George. It is 32 km from McLeod Lake to the Carp Lake campground. This gravel road is single lane over part of its length, and has some rough surfaces and tight corners. The road may not be suitable for cars or trailers during the spring break-up period. Some portions of the road must be shared with industrial traffic. The closest communities, towns and cities are Prince George, Bear Lake, McLeod Lake and MacKenzie.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/carp-lake-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483626,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648,-2147483645]},{"resourceLocationId":-2147483630,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Cathedral","fullName":"Cathedral Provincial Park","description":"Backcountry camping in the core area of Cathedral Park is limited to Quiniscoe Lake and Lake of the Woods campgrounds. There is currently no system in place to allow for reserving a site at either location. As both campgrounds can be at over-capacity on weekends during July, August and into September we ask that you consider a weekday or off-peak month trip, if your schedule can accommodate it. The shuttle service to Quiniscoe Lake, operated by Cathedral Lakes Lodge, is not able to inform park users of the current or future campground status","drivingDirections":"Cathedral Park is southwest of Keremeos, bounded on the south by the British Columbia-Washington State border, on the east by Ewart Creek, and on the west and north by the Ashnola River. </p> Access is via Highway 3: three kilometres west of Keremeos, the Ashnola Road leaves the highway and crosses a red covered bridge, 10 kilometres further the pavement ends and the Ashnola Forest Service Road begins and follows the Ashnola River into the park. This road extends 48 kilometres upstream to the south end of the Ashnola Valley. </p> There are three hiking routes that provide access to the park’s core from the Ashnola River corridor: Ewart Creek, Lakeview, and Wall Creek. These routes are described on the hiking page. No vehicles into core area on private access road, hike-in only to core area.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/cathedral-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483624,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483641]},{"resourceLocationId":-2147483629,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Champion Lakes","fullName":"Champion Lakes Provincial Park","description":"Known as an ideal destination for family fun, Champion Lakes Provincial Park with its 3 lakes offers an all-inclusive recreational package to visitors including fishing, canoeing, hiking, mountain biking and swimming. There are 6.5 km of multi-use trails linking the lakes together. 3rd lake with its two day-use areas is known for warm water and is popular with the local communities. Champion Lakes Golf and Country Club is a quick 20-min drive from the Park.\n          Champion Lakes Provincial Park takes its name from the lakes and creek by that name and is located in the Selkirk Mountains, 18 km north west of Fruitvale. The special features of this park include the chain of picturesque small lakes, old growth forest and an example of forest succession.","drivingDirections":"Located in south central BC, this park is 6 km north-east of Fruitvale off Highway 3B or just 8 km west of the junction of Highway 3 and 3B. From the turn off, it's a 12 km, 20-min drive to the park entrance.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/champion-lakes-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483623,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648]},{"resourceLocationId":-2147483628,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Charlie Lake","fullName":"Charlie Lake Provincial Park","description":"Charlie Lake Provincial Park is situated on the southwestern shore of 13 km long Charlie Lake. Covering some 92 hectares, the park lies within the rolling landscape of the Interior Plains. Wander a forested trail or watch children enjoying the play area in the centre of the campground.","drivingDirections":"The park is located 11 km north of Fort St. John at the junction of the Alaska Highway and Highway 29.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/charlie-lake-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483622,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648,-2147483640]},{"resourceLocationId":-2147483626,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Conkle Lake","fullName":"Conkle Lake Provincial Park","description":"A secluded lake in the Okanagan Highland east of Osoyoos, set amid a forest of western larch and lodgepole pine intermingling with willow and black alder that cover the sharply rising surrounding hills. Conkle Lake, named for W.H. Conkle, an early settler in the nearby Kettle Valley, is noted for its rainbow trout. Visitors have come for many years to fish the lake, sunbathe, swim and hike to various viewpoints.","drivingDirections":"There are two access routes, both narrow and winding forest service roads that are unsuitable for motorhomes, vehicles towing trailers or low-clearance vehicles. It is 16 km to the entrance from Highway 33, just north of Westbridge and 26 kilometres from Highway 3, six km east of Bridesville. The access off Highway 3 is the better route. Follow signs along the forest service roads. The two accesses join 1 km from the park, at which point there is a gate. The closest communities, towns and cities are Rock Creek, Westbridge, Midway, Greenwood and Osoyoos.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/conkle-lake-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483620,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483644]},{"resourceLocationId":-2147483624,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Crooked River","fullName":"Crooked River Provincial Park","description":"Crooked River lies within the Fraser Basin, an irregularly shaped basin of gently rolling hills and shallow lakes covering much of the North Central B.C. Three beautiful lakes are contained within this 970 hectare park. The centre of activity of this park, an hour's drive north of Prince George, is beach-fringed Bear Lake. The fine, sandy beaches are some of the best in the region and are favourites of swimmers and sunbathers. Fishing, hiking, camping and nature study are also popular activities with outdoor enthusiasts. Visitors like to hike to nearby Square Lake or along the willow-lined Crooked River, the original route of early explorers. A natural feature in the park is Livingston Springs (which are cold water springs that run year round).","drivingDirections":"The park is located 70 km north of Prince George on Highway 97. This is approximately a one hour drive. The closest communities, towns and cities are Bear Lake and Prince George.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/crooked-river-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483618,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648]},{"resourceLocationId":-2147483623,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Cultus Lake","fullName":"Cultus Lake Provincial Park","description":"As one of the most popular destination areas in the Lower Mainland, Cultus Lake Provincial Park is characterized by a large, warm freshwater lake and scenic forest-clad mountains. The park is almost evenly divided between the northwest and southeast sides of Cultus Lake. The northwest portion is mostly undeveloped with the visitor-oriented facilities confined to the southeast portion. Just an hour and a half drive away from Vancouver, visitors will find four campgrounds, a large day-use area for picnicking and boating, and ample opportunity for fishing, water skiing, wind surfing and hiking.","drivingDirections":"Cultus Lake Provincial Park is located 11 km southwest of Chilliwack. Access to the park is off Highway 1 at the Yarrow or Sardis exits. It is 16 km to the park entrance from Yarrow and 10 km from Sardis via the Columbia Valley Highway, which bisects the southeast section of the park.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/cultus-lake-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483617,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648,-2147483645,-2147483644]},{"resourceLocationId":-2147483622,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Desolation Sound","fullName":"Desolation Sound Marine Provincial Park","description":"<p>There are 11 designated campsites throughout Desolation Sound, the Copeland Islands and Malaspina Provincial Marine Parks, collectively called Desolation Sound. Permits for Desolation Sound are valid for overnight use in the Copeland Islands, Malaspina, Roscoe Bay, and Desolation Sound Provincial Marine Parks. Camping is <b>only permitted in designated campsites (tent pads).</b></p>\n          <p><b>Pit Toilets:</b>Pit toilets are located at Grace Harbour, Tenedos Bay, Curme Islands, Bold Head, Hare Point, Feather Cove, Copeland Islands, Melanie Cove, and Roscoe Bay.  Please note the outhouses throughout Desolation Sound are an open-air-privy design to provide a sanitary camping experience while protecting the Parks’ natural and cultural resources. Please bring your own toilet paper and do not put garbage in the outhouse tanks.</p>\n          <p><b>Water:</b>There is no potable water provided at any of the designated campsites.  There is untreated surface water at Tenedos Bay, Roscoe Bay, and Grace Harbour, and this water must be treated prior to consuming.</p>\n          <p><b>Camping Regulations:</b>\n          <ul>\n          <li>Campers must have a valid backcountry registration for overnight camping </li>\n          <li>Campsites are available on a first-come, first-served basis. Please do not hold sites for other parties.</li>\n          <li>Please remove your gear and make the tent pad available for the next visitors by noon. </li>\n          <li>Campfires are <b>not permitted</b> throughout the marine parks; observe posted signs</li>\n          <li>Fires are permitted in designated fire rings at Tenedos Bay and Roscoe Bay.  Firewood is not provided.  It is an offense under the Park Act to remove wood form the park.</li>\n          <li>If you arrive at your intended campsite destination and there are no tent pads available:\n          <ol>\n          <li>Carry on to a second destination if weather, time and stamina allow.</li>\n          <li>Please share a tent pad.</li>\n          <li>If you cannot find a tent pad, then please camp on a previously trampled area within the campsite area.</li>\n          </ol> </li>\n          </ul></p>","drivingDirections":"North of Powell River and Lund on the Sunshine Coast; 90 miles north of Vancouver. Lund is the closest community, town or city.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/desolation-sound-marine-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483616,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483641]},{"resourceLocationId":-2147483621,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Dionisio","fullName":"Dionisio Point Provincial Park","description":"There are 30 walk-in sites in the park in two separate camping areas. Water and pit toilets are provided. Fees apply for overnight camping and are payable at the self registration vaults located at the information shelters in the designated camping areas. Protect foodstuffs in tight containers to prevent raccoons and crows from stealing your provisions. Please practice “Leave No Trace” camping ethics. Garbage facilities are not provided; visitors must pack out all of their garbage. Please ensure you camp in designated areas. Human disturbance of the vegetation leads to erosion of the sensitive shoreline and the potential destruction of archeological sites.   Dionisio Provincial Park is open year round; a camping fee and services are provided from May 14 to September 15. Fees apply year round.","drivingDirections":"Dionisio Point Park is located on the northeast tip of Galiano Island overlooking Porlier Pass in the southern Gulf Islands. Access to the park is by boat only. Boaters can reference marine chart #3442, #3461, #3443 and #3473 for more information on this area.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/dionisio-point-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483614,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483641]},{"resourceLocationId":-2147483620,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Discovery Island","fullName":"Discovery Island Marine Provincial Park","description":"Discovery Island Marine Provincial Park has one designated camping area that offers open field camping. No facilities are provided other than a pit toilet. Fees apply for overnight camping and are payable at self registration vaults, located at the information shelter. The camping area is located just southwest of Pandora Hill.  There is a camping fee and services provided year-round. The park is accessible from Victoria, where paddlers can launch from Cattle Point, just north of the Oak Bay Marina. Kayakers paddling between Oak Bay and Discovery Island will be delighted by the wildlife along this route, which features a sensitive seabird nesting area and ecological reserve. Sightings of seals, sea lions, otters and bald eagles are common around the park.","drivingDirections":"","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/discovery-island-marine-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483613,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483641]},{"resourceLocationId":-2147483619,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Dry Gulch","fullName":"Dry Gulch Provincial Park","description":"Dry Gulch is a cozy, quiet campground located 4.5km south of Radium Hot Springs off of Highway 93/95. It is a shady retreat under the peaks of the Standford Rage amid the Rocky Mountains. It is a short drive to visit the hot springs in Radium, scenic hikes in Kootenay National Park, or the many tourist offerings in the city of Invermere.","drivingDirections":"Located 4.5 km’s south of the town of Radium Hot Springs on the east side of the Columbia Valley and Highway 93/95.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/dry-gulch-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483612,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648]},{"resourceLocationId":-2147483617,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Elk Falls","fullName":"Elk Falls Provincial Park","description":"<p>Elk Falls Provincial Park is a popular destination campground on Vancouver Island. Explore the incredible camping, hiking, biking, and fishing opportunities this park and region have to offer.</p>\n        <p>Elk Falls Provincial Park (Quinsam Campground) is conveniently located just 2km from downtown Campbell River. The park boasts large private sites along the Quinsam River and rests in a beautiful second growth forest setting. It is one of the largest campgrounds in the area and features a new adventure playground for kids to explore.</p>\n        <p>Park visitors to Elk Falls will enjoy the extensive forest trail network and the hiking opportunities. Impressive waterfalls serve as a beautiful backdrop while hiking through coastal forests. Minutes from the main campground, visitors can explore the impressive new suspension bridge. Access to the bridge can be found off the Canyon View Trail. Adventurous park users will be awe-struck at the views found from this newly-built attraction!</p>\n        <p>Fishing is available at Elk Falls in the Quinsam and Campbell Rivers. Campbell River is known as the Salmon Capital of the world; from November to March the steelhead run right by campsites on the Quinsam River.</p>","drivingDirections":"The Quinsam Campground at Elk Falls Provincial Park is located 3 km north of Campbell River on central Vancouver Island on Hwy 28 toward Gold River. The Elk Falls day-use areas are located 3 km west of the campground off Hwy 28.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/elk-falls-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483610,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648]},{"resourceLocationId":-2147483616,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Elk Lakes","fullName":"Elk Lakes Provincial Park","description":"A per-person fee is charged at Lower Elk Lake and Petain Creek Campgrounds which have tent pads, outhouses and food caches (designated areas).  Wilderness camping is not permitted within 2 km of a designated area. The Alpine Club of Canada is permitted to operate a small public cabin, on behalf of BC Parks, at the trailhead. For more information or reservations contact the Alpine Club of Canada at 403-678-3200 or <a href='http://www.alpineclubofcanada.ca/'>http://www.alpineclubofcanada.ca/ </a>","drivingDirections":"Elk Lakes Provincial Park is located in southeastern BC, about 104 kilometres north of Sparwood. Turn off Highway 3 at Sparwood and go north on Highway 43 till you reach the community of Elkford, a distance of 35 kilometres. From here, travel the gravel road on the west side of the Elk River. Approximately 47 kilometres north of Elkford the road crosses the Elk River and joins the Kananaskis Power Line Road. It is 5.8 kilometres from the crossing to the Cadorna Creek trailhead; the Elk Lakes trailhead is a further 16.1 kilometres. Driving time from Sparwood to the park is approximately two hours. Access to the park is also possible from Alberta’s adjoining Peter Lougheed Provincial Park.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/elk-lakes-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483609,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483641]},{"resourceLocationId":-2147483615,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Ellison","fullName":"Ellison Provincial Park","description":"Nestled on the northeastern shore of Okanagan Lake, Ellison Provincial Park includes 200 hectares of forested benchlands above a rocky shoreline of scenic headlands and sheltered coves. The park's natural attractions, combined with the dry, sunny Okanagan climate provide many recreational opportunities from spring through fall. Hiking trails along the scenic headlands are steep and require care and attention.","drivingDirections":"If coming from Highway 97 north, turn right on 25th Avenue (main intersection downtown Vernon), park is 16 km or approximately 20 minutes from that junction. If coming from Highway 97 south, turn left on 25th Avenue (in Vernon), through Okanagan Landing Road, follow blue and white VIP signs saying Ellison Park.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/ellison-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483608,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648]},{"resourceLocationId":-2147483614,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Englishman River Falls","fullName":"Englishman River Falls Provincial Park","description":"Situated along the pristine Englishman River north of Nanaimo, Englishman River Falls Provincial Park features two stunning waterfalls cascading along the descending riverbed into a deep canyon.\nThis picturesque destination, set amid a lush old-growth and second-growth forest of Douglas fir, cedar, hemlock and maple, is an ideal location from which to explore and appreciate the incredible diversity of south central Vancouver Island, including nearby Cathedral Grove, the Pacific Rim, and the sandy shores of Parksville and Qualicum.\nThe park has a large day-use area and campground and contains several hiking trails that meander through the forest and along the river. Visitors can expect spectacular views along the way, particularly from two bridges that cross the river where it plunges down the narrow rock canyon toward quieter waters below. The lower falls end in a deep crystal-clear pool - an ideal swimming hole in the summer when river levels are low and a great place to view spawning salmon in the fall.","drivingDirections":"Englishman River Falls Provincial Park is located 13 km southwest of Parksville on central Vancouver Island. Take Errington Road off Highway 4A, toward Port Alberni. Directional signs are posted on main highways. Nearby communities include: Parksville, Qualicum, Coombs, Errington, Nanaimo.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/englishman-river-falls-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483607,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648]},{"resourceLocationId":-2147483613,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Fillongley","fullName":"Fillongley Provincial Park","description":"This small picturesque park on the north side of Denman Island offers an idyllic location to enjoy a picnic and spend a quiet afternoon. The land that is now Fillongley Provincial Park was bequeathed to the province of British Columbia by George Beadnell, an Englishman who settled here at the turn of the century. Over the years, Beadnell developed Fillongley into one of the most beautiful estates in the Gulf Islands. A large, flat grassy field once the site of a bowling green comes alive with vibrant wildflowers in the spring. Set amongst a canopy of imported deciduous trees, this park is also noted for its beautiful display of colours in the fall.\n       Ten campsites are located along the ocean, and there are several walking trails through the park where visitors can observe the old-growth cedar forest, a salmon spawning stream and remains of the old homestead.","drivingDirections":"Fillongley Park is located on Denman Island. Take the Denman Island Ferry from Buckley Bay, off Hwy 19a on central Vancouver Island. Take the Buckley Bay exit 101 from Hwy 19. Once on the island, follow Denman Road to Swan Road. Turn left on Swan Road, then right on Beadnell Road. Nearby communities include: Denman Island, Hornby Island, Buckley Bay, Fanny Bay, Comox Valley","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/fillongley-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483606,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648]},{"resourceLocationId":-2147483612,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Fintry","fullName":"Fintry Provincial Park","description":"Fintry Provincial Park includes 360 hectares of the former Fintry Estate, a heritage site with a colourful history. From the delta area to a forested area made up of ridges and deep slopes, this park offers two dramatically different topographical areas. There is over 2 km of waterfront with surrounding mountains and deep canyons. Shorts Creek passes through a deep canyon creating a series of waterfalls and deep pools. With almost two kilometres of waterfront property, the park has opportunities for camping, swimming, fishing, canoeing, kayaking, hiking and wildlife viewing. Recreational users can enjoy the natural sand beach while wildlife viewers can hike the Canyon trail and view a variety of birds, small mammals, deer and bighorn sheep in the higher regions. Historical features throughout the park include the Manor House, the octagonal barn and several other farm buildings. A small wetland area located south of the Packing House, a portion of lakeshore and the Shorts Creek corridor and canyon below Westside Road are designated Special Feature-Natural Conservation Areas. Notable features within the zone include a large eagle's nest, old growth cottonwoods and several wildlife trees, Shorts Creek waterfall and kokanee spawning grounds. The Fintry Manor House, garden, the barns, remnant power generation and irrigation systems are special heritage features. \nFintry Protected Area was established on April 18, 2001, to enhance the ecological viability of the existing Park. This protected area protects important California bighorn sheep habitat and provides increased representation of the North Okanagan Basin ecosection by capturing an increased elevational gradient as well as providing a spectacular canyon and hiking and viewing opportunities.","drivingDirections":"The park is located on Fintry Delta Road, off Westside Road, approximately 34 km north of Kelowna or 49 km south of Vernon. The park is on the northwest side of Okanagan Lake. Watch for marker signs located on Hwy 97. Access is also possible by boat: 6 km across Okanagan Lake from Ellison Provincial Park and 6 km across the lake from Kopje Regional District Park in Lake Country. The closest communities, towns and cities are Kelowna, Vernon, Lake Country (across Okanagan Lake) and the Westside Road Community Plan area from Trader's Cove to Killiney Beach.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/fintry-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483605,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648,-2147483644]},{"resourceLocationId":-2147483610,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"French Beach","fullName":"French Beach Provincial Park","description":"Situated on the scenic Strait of Juan de Fuca on the west coast of southern Vancouver Island, French Beach Provincial Park offers much more than just beautiful hiking trails through lush forests. A wide swatch of green lawn fronts this sand and pebble beach, where visitors can relax and enjoy a picnic or take a cool dip in the ocean.\nIn addition to offering fabulous views of the Strait of Juan de Fuca and the Olympic Mountains, the 1,600-meter beach at this park is an ideal location for exploring and whale watching. The magnificent Gray whales pass by this park in the spring as they migrate to northern feeding grounds, and return again in the fall. Roaming pods of resident killer whales can also be seen offshore, as well as otters, seals and sea lions. French Beach is also a good spot to observe Bald eagles, ospreys and a variety of seabirds.","drivingDirections":"French Beach Provincial Park is located on the west coast of southern Vancouver Island. The park can be accessed via Hwy 14, 20 km west of Sooke. Directional signs are posted. The park is located approximately 11 km from Jordan River. Nearest communities, towns or cities are Sooke, Jordan River, Port Renfrew, Victoria.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/french-beach-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483603,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648,-2147483644]},{"resourceLocationId":-2147483607,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Gladstone","fullName":"Gladstone Provincial Park","description":"Gladstone is, perhaps, most well known for the vehicle accessible Texas Creek campground which was added to the park area in 1995 and provides excellent camping, picnicking and a safe swimming area. However, the park also has significant wilderness value. It provides a diversity of habitats in the Selkirk Foothills ecosection of the province that is found nowhere else. These include Kokanee spawning areas, winter range for deer and elk, and of particular importance, low elevation habitats and old growth cedar and hemlock forests. There are several short trails that lead from the campground to the lake. Christina Lake has a reputation as one of the warmest and clearest lakes in Canada. There are several pocket beaches that provide great opportunities for privacy and quiet moments. The Monashee Mountains surround the lake and it is a perfect backdrop for a variety of water-oriented recreational activities. Fishing for Kokanee, Rainbow Trout and Small-mouth Bass is popular. The protection of spawning areas in the park such as Sandner Creek is extremely important.\nTwo areas of the park have been zoned as Special Features: the pictographs on the east shore of Christina Lake and the Troy/Sandner Creek area at the north end of Christina Lake from 100 metres off-shore to one kilometre inland to protect the provincially significant spawning habitat for kokanee and rainbow trout and the area's importance for grizzly and black bear habitat during the fish spawn.","drivingDirections":"Gladstone Park is located approximately 20 km northeast of Grand Forks on Hwy 3 at the north end of Christina Lake in the Monashee Mountains. The most common accesses to the park are via the Texas Creek campground and by boat from Christina Lake. The campground is 5 km east of Christina Lake on Hwy 3; turn onto East Lake Drive and follow 4 km to the 63 site campground at the end of the road. There is rough 4WD access to Xenia Lake 22 km up the North Fork Rd from Grand Forks to Miller Creek Rd; turn right and go about 4 km. Look for a small road on the left marked with a white deactivated road sign that leads to the lake. There is also access to the Mt. Gladstone trailhead from Hwy 3 and the abandoned CPR railway at Paulson, the Mt. Faith trailhead from the Burrell Forest Service Road, and Peter Lake from Dog Creek Road.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/gladstone-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483600,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648]},{"resourceLocationId":-2147483605,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Goldstream","fullName":"Goldstream Provincial Park","description":"Massive trees, majestic waterfalls, a meandering river that meets the sea, flowers, birds and fascinating fish are but a few of the attractions that draw people to Goldstream Provincial Park, a mere 16 km from downtown Victoria on southern Vancouver Island.\nIt's a world that seems far removed from the urban adventures of British Columbia's capital city whether the visitor is a hiker seeking inspiration from this magnificent example of the great outdoors or a naturalist looking to add to their notebook. There's something new, different and exciting every month of the year at Goldstream Park.\nGoldstream's numerous trails criss-cross through the dramatically different terrain of two distinct vegetation zones. The park is home to 600-year-old Douglas fir trees and western red cedar, mixed with western yew and hemlock, red alder, big leaf maple and black cottonwood. On the drier ridges visitors can find flowering dogwood, lodgepole pine and arbutus. The arbutus, with its thick leathery evergreen leaves, red-dish trunk and peeling bark, is Canada's only broad-leafed evergreen and is found exclusively on Vancouver Island and on the southwest coast of British Columbia. In the spring and early summer, Goldstream overflows with colourful wildflowers, including the shade-loving western trillium and the calypso, a delicate orchid of the mossy forest glades.","drivingDirections":"Goldstream Provincial Park is located 16 km northwest of Victoria on southern Vancouver Island on the Trans Canada Hwy (Hwy 1). There are separate entrances for the main campground, group campsite and day use area:\n- Visitors coming to the campground now must use Amy Road via Westshore Parkway to get to the campground. The Westshore Parkway intersection is just south of the old (now closed) Sooke Lake Road intersection and the first traffic signal after the Spencer Road intersection on Trans Canada Hwy 1. \n- The entrance to the day-use area is at the junction of Trans Canada Hwy 1 and Finlayson Arm Road. \n- The entrance to the group campsite is off the Trans Canada Hwy 1 opposite the now closed Sooke Lake Road intersection. \nNearby communities include: Victoria, Langford, Duncan, Colwood, Metchosin, Sooke.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/goldstream-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483598,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648,-2147483644]},{"resourceLocationId":-2147483604,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Gordon Bay","fullName":"Gordon Bay Provincial Park","description":"For a great family camping vacation, head to Gordon Bay Provincial Park, located on the shores of Lake Cowichan, north of Duncan on Vancouver Island. In the summer the lake is warm and the sandy beach makes for great family swimming. History buffs find plenty to interest them in the park and the surrounding area, which is home to a second-growth Douglas-fir forest. Set in one of Vancouver Island's sunniest valleys, this area boasts the highest average annual temperature in Canada.\n          The lake is known for its spectacular fresh-water fishing in the spring, fall and winter, when anglers can be challenged by rainbow, cutthroat and Dolly Varden trout. Waterskiing and windsurfing are also popular activities on the lake.\n          This small wilderness area features a number of walking and hiking trails with unparalleled views. Keen-eyed hikers can spot a variety of wildlife and birds, including juncos, Stellar's jays, chestnut-backed chickadees, mergansers and golden eye ducks. Visit in April when the wildflowers are at their peak.","drivingDirections":"Gordon Bay Provincial Park is located 35 km northwest of Duncan on southern Vancouver Island. The park, situated on the shores of Cowichan Lake, is accessed via Hwy 18 off Hwy 1. Travel 26 km west on Hwy 18 to Lake Cowichan, then 14 km on South Shore Road. Nearby communities include: Honeymoon Bay, Cowichan Lake, Youbou, Duncan, Victoria.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/gordon-bay-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483597,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648,-2147483647,-2147483644]},{"resourceLocationId":-2147483603,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Green Lake","fullName":"Green Lake Provincial Park","description":"Green Lake Provincial Park is made up of 11 sites: Arrowhead, Black Bear, Blue Spring, Boyd Bay, Buckside Hill, Emerald Bay, Green Lake Islands, Little Arrowhead, Nolan Creek and Sunset View. Six of these sites have developed facilities. The open rangeland and mixed forests of aspen and lodgepole pine found here are typical of the Cariboo’s landscape. Green Lake is one of the larger bodies of water in the southern portion of the Cariboo. The lake is about 14 km long averaging 1.5 km in width with an irregular shoreline of approximately 57 km. The lake has a low flushing rate and together with the chemical composition of the warm shallow waters, creates the greenish hue giving the lake its name.","drivingDirections":"There is a BC Parks information shelter, which provides information on campground and picnic area locations and a sani-station, located at the south end of the park. Access is approximately 16 km northeast of 70 Mile House off Hwy 97 along North Bonaparte Road or approximately 18 km south of Hwy 24 at Lone Butte and follow the signs along Watch Lake Road. The closest communities, towns and cities are 70 Mile House, Lone Butte and 100 Mile House.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/green-lake-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483596,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648,-2147483644,-2147483640]},{"resourceLocationId":-2147483498,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Gwillim Lake","fullName":"Gwillim Lake Provincial Park","description":"<p>Gwillim Lake Provincial Park is situated half way between Chetwynd and Tumbler Ridge on the beautiful Don Phillips Way (Highway 29) amidst the Rocky Mountain foothills.</p>\r\n\r\n<p>The 32,326 hectare park boosts wildlife, activities and landscapes for everyone to enjoy. The campground has a wilderness trail, play area, boat launch, viewpoint and lakeside day-use. Be sure to take advantage of the excellent water activities this park has to offer and remember to bring your fishing rod, canoe, kayak and boat.</p>","drivingDirections":"This park is located 56 km southeast of Chetwynd towards Tumbler Ridge; take Highway 29 south off Highway 97 (paved access).","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/gwillim-lake-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483435,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648]},{"resourceLocationId":-2147483602,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Halkett Bay","fullName":"Halkett Bay Marine Provincial Park","description":"Located in scenic Howe Sound, Halkett Bay is typical of the glaciated coastline found in the sound. The steeply sloped mountains, rugged coastlines, and the scattered islands and waters of the sound offer a breathtaking visual experience. Howe Sound has long been popular with pleasure boaters because of its close proximity to Vancouver, Sunshine Coast and Squamish population. Halkett Bay is currently used by boaters for both day-use and recreational activities such as swimming, wilderness camping, kayaking, picnicking, hiking to Mount Artaban and overnight moorage. The park provides one buoy, one dinghy dock and one pit toilet.","drivingDirections":"Halkett Bay Provincial Park is located on the southeastern shore of Gambier Island, 15 km from Horseshoe Bay. Located 40 km from marinas in Vancouver and 10 km from Lions Bay, it is well within day-use range of most boaters.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/halkett-bay-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483595,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483641]},{"resourceLocationId":-2147483601,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Herald","fullName":"Herald Provincial Park","description":"Herald Provincial Park is a popular destination campground and day-use area. The park covers 79 hectares of beautiful beach and forested uplands, and boasts a 128-site campground, boat launch and large day-use area. Swimming, fishing and bird-watching are popular activities, as is the self-guided nature walk to Margaret Falls. Just 14 kilometres from the Trans Canada Highway along the western shore of the Salmon Arm of Shuswap Lake, Herald is a great spot to use as a base camp for visiting the many attractions of the Shuswap area.","drivingDirections":"This park is located 14 km east of the Trans Canada Hwy. at Tappen, BC. It is on the west shore of the Salmon Arm of Shuswap Lake. The closest communities, towns and cities are Tappen, Canoe, Sorrento and Salmon Arm.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/herald-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483593,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648]},{"resourceLocationId":-2147483600,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Horsefly Lake","fullName":"Horsefly Lake Provincial Park","description":"This park offers a popular 23 site campground and day-use area which has a developed beach, a horseshoe pit and a nature trail. Some activities offered include hiking, exploring and fishing. This is a large, deep lake and is usually fished on a troll   included are a number of smaller lakes excellent for fly-fishing. Fishing for rainbow trout is a favourite pastime of many visitors.","drivingDirections":"The park is located on Horsefly Lake, approximately 65 km from 150 Mile House off Highway 97; 55 km of the route is paved, and 10 km is well-maintained gravel. The closest community is Horsefly, located 13 km southwest of the park. Other communities are Likely and Williams Lake.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/horsefly-lake-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483592,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648]},{"resourceLocationId":-2147483599,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Inland Lake","fullName":"Inland Lake Provincial Park","description":"Inland Lake Provincial Park boasts a 13 km wheelchair accessible trail around Inland Lake. There are drive-in and walk-in campsites available at this park, as well as opportunities for swimming, cycling, fishing, canoeing and boating (10hp max). The quiet, forested campground on the shores of Inland Lake creates a secluded and sheltered camping experience offering magnificent sunrises and sunsets over the lake. Amenities include pit- toilets, a hand-pump for water, a dock to boat and swim from and a boat launch.","drivingDirections":"The park is located north of Powell River. Turn up a short but steep hill on Haslam Street north of Cranberry Lake, turn left onto the gravel road, continue on for about 5 km, turn right on the Haywire Bay/Inland Lake intersection another 2 km, turn left into the park.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/inland-lake-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483591,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648,-2147483641]},{"resourceLocationId":-2147483598,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Jedediah Island Marine","fullName":"Jedediah Island Marine Provincial Park","description":"<p>Jedediah Island Marine Provincial Park is located between Lasqueti and Texada Islands in the Sabine Channel of Georgia Strait, off central Vancouver Island and the Sunshine Coast. Access to the park is by boat from nearby Lasqueti Island. Nearby communities include: Texada Island, Lasqueti Island, French Creek, Parksville and Secret Cove.</p>\n          <p>It is the largest and most diverse of a chain of more than 30 islands and rocky islets located north and west of Lasqueti Island. The interior of Jedediah is comprised of forest ecosystems where you will see a variety of mature tree species, including Douglas fir and arbutus, intermingled with rocky outcrops. In several areas evidence of previous human settlements are evident. A rich marine environment encircles Jedediah Island, which offers secluded bays and coves for safer harbour.</p>\n          <p>Jedediah’s isolation and tranquility make it an excellent destination for kayaking and wilderness camping.  Some of the best camping areas are Long Bay and Sand Beach. Small bays on the east side of the island provide campers with a little more privacy, especially during the summer at the height of kayaking-touring season, when the island can get quite busy.</p>\n          <p>Surface water is extremely limited in this park, so be sure to bring drinking water with you. Any water found in streams in the park must be boiled, treated or filtered prior to consumption.</p>\n          <p>Please practise \"Leave No Trace\" camping ethics.</p>","drivingDirections":"Jedediah Island Marine Provincial Park is located between Lasqueti and Texada islands in the Sabine Channel of Georgia Strait, off central Vancouver Island. Access to the park is by boat from nearby Lasqueti Island. Nearby communitites include: Texada Island, Lasqueti Island, French Creek.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/jedediah-island-marine-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483589,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483641]},{"resourceLocationId":-2147483503,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Jimsmith Lake","fullName":"Jimsmith Lake Provincial Park","description":"<p>This 35 site campground situated among a lakeside Douglas fir and larch forest, is a peaceful and welcome retreat for the traveling public and visitors to the nearby city of Cranbrook. The campground was rebuilt in 2001 to accommodate recreational vehicles.</p>\r\n\r\n<p>Sunbathing, swimming, non-motorized boating and picnicking are popular activities at Jimsmith Park that are located in a day-use waterfront area. The day-use gates are open from 8:00am to 10:00pm.</p>\r\n\r\n<p>This is the perfect setting for nature study and wildlife viewing. In winter, the park is transformed into a snowy playground for tobogganing and ice skating.</p>","drivingDirections":"Access the park from Hwy 3/95 at the south side of Cranbrook, then drive west 4 km on a paved secondary road to the park entrance. The community of Cranbrook is 5 km east of Jimsmith Lake Park.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/jimsmith-lake-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483440,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648]},{"resourceLocationId":-2147483597,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Joffre Lakes","fullName":"Joffre Lakes Provincial Park","description":"Backcountry camping is only available at Upper Joffre Lake within the designated tentpad area. Camping is not permitted outside of the designated area or off the tentpads. \n          Facilities include 26 rustic gravel tentpads adjacent to the lake, an outhouse, and a food storage facility. Camping is located at the end of a hiking trail 5.5 km from the trail head and limited parking is available at the trail head. \n          Reservations are required year-around. There is no cell phone coverage in this park. No pets are allowed within the park. Fires are prohibited. Potable water is not available - bring your own water or sterilize nearby stream /lake water.","drivingDirections":"Off Hwy 99, approximately 30 kilometers east of Pemberton, BC on the Duffey Lake Road. Other nearby communities includes Mount Currie.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/joffre-lakes-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483588,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483642]},{"resourceLocationId":-2147483596,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Juan de Fuca","fullName":"Juan de Fuca Provincial Park","description":"Juan de Fuca Provincial Park on the west coast of southern Vancouver Island offers scenic beauty, spectacular hiking, marine and wildlife viewing and roaring surf in its course along the Pacific coastline of the Strait of Juan de Fuca.\n          There are four main areas to the park: the China Beach Campground, the Juan de Fuca Marine Trail, the China Beach day-use area and Botanical Beach.","drivingDirections":"Located on the west coast of southern Vancouver Island, Juan de Fuca Provincial Park extends from China Beach, just west of the community of Jordan River, to Botanical Beach near Port Renfrew. The park is accessed by vehicle at various points along West Coast Highway 14 between Jordan River and Port Renfrew. The China Beach campground is adjacent to Highway 14 just east of the China Beach day-use, 35 km west of Sooke and 36 km east of Port Renfrew. Nearby communities include: Port Renfrew, Sooke, Victoria, Duncan.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/juan-de-fuca-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483587,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648,-2147483641]},{"resourceLocationId":-2147483595,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Juniper Beach","fullName":"Juniper Beach Provincial Park","description":"Juniper Beach was established as a Provincial Park in 1989. The park protects a representative desert landscape which contains sagebrush, prickly pear cactus and of course, juniper. Part of the landscape includes deep post-glacial deposits and large scale erosion features.\n\n          It is a convenient overnight camping spot for travelers on Hwy #1 and provides access to the Thompson River. Both CNR and CPR railway tracks run by the park and provide an attraction to train-buffs. This park is also a popular base camp for visitors enjoying boating, fishing, photography and touring historic Hat Creek Ranch and Ashcroft Manor, both nearby.","drivingDirections":"On the north shore of the Thompson River, 19 km east of Cache Creek on Hwy #1. The closest communities, towns and cities are Cache Creek and Savona.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/juniper-beach-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483586,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648]},{"resourceLocationId":-2147483594,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Kekuli Bay","fullName":"Kekuli Bay Provincial Park","description":"Kekuli Bay Provincial Park is situated on the west side of Kalamalka Lake just outside of Vernon.  Kekuli Bay is a major destination for boaters in the summer months.  In the spring and fall, Kekuli Bay is a perfect destination for RVers to come and relax in the warm sun.  The wild rose bushes and sunflowers are in full bloom during the spring months and there is a nature loop where you can walk the surrounding grasslands.  All campsites offer spectacular views of Kalamalka Lake.  Manicured landscaping offers grassy areas, shade and privacy between sites. Kekuli Bay has become one of the most popular camping destinations in the North Okanagan.","drivingDirections":"11 km. south of Vernon, off Highway 97; park is on west side of Kalamalka Lake. The park boundary is 2 km from the Hwy 97 turnoff and the campground is 1 km beyond that. The highway turnoff is well signed.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/kekuli-bay-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483585,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648]},{"resourceLocationId":-2147483593,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Kentucky Alleyne","fullName":"Kentucky-Alleyne Provincial Park","description":"Wide open spaces, great fishing, wildlife, old west history and a quieter camping spot can all be yours in less than a 90 minute drive from the central Okanagan. Located in the heart of cattle country, the rolling grasslands and dry open forest surround the sparkling turquoise waters of Kentucky Lake and Alleyne Lake. The scenery is spectacular from early April to late October with springs’ palette of soft pastels slowly changing to the vibrant golds of autumn.<br / ><br / >\n          Once known only by local fishers and their friends, the park is being discovered as a weekend destination from the coast and from the Okanagan. The Coquihalla and the Hwy 97C Connector have made the access easier to these beautiful fishing lakes.","drivingDirections":"The park is located 38 km south of Merritt or 11 km south of Aspen Grove, just off Hwy 5A. From the east, the park is 11 km. from Coquihalla Highway 97C on paved access. The closest communities, towns and cities are Aspen Grove, Merritt, Princeton and Elkhart Lodge.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/kentucky-alleyne-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483584,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648,-2147483644]},{"resourceLocationId":-2147483592,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Kettle River","fullName":"Kettle River Recreation Area","description":"Kettle River Recreation Area is one of the largest and most popular destination family campgrounds in the Okanagan Boundary Region. Located minutes from amenities in Rock Creek, it is only 45 minutes from Osoyoos and 90 minutes from Kelowna. Campers will want to bring their bikes and floaties! This park offers fantastic biking/hiking opportunities and access to the historic Trans Canada Trail network. In the summer months, campers walk their tubes and floaties to the Kettle River that flows alongside the campground, while others enjoy basking on the sandy beaches and swimming in the river. The iconic Kettle River Trestle at the day-use serves as a beautiful backdrop for park users and is a great photo opportunity. Spring and autumn campers enjoy large, sun-filled sites in a peaceful, pristine setting.","drivingDirections":"Located 5 km north of Rock Creek on Hwy 33. The closest communities, towns and cities are Rock Creek, Westbridge, Midway, Greenwood and Osoyoos.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/kettle-river-recreation-area/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483583,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648,-2147483644]},{"resourceLocationId":-2147483591,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Kikomun Creek","fullName":"Kikomun Creek Provincial Park","description":"Located in a dry sunny area of the province, this park preserves an example of Interior Douglas fir and Ponderosa pine forest and grassland habitat. Paved roads within this family oriented park are conducive to biking.","drivingDirections":"From Hwy 3, turn onto Kikomun-Newgate Road. The park entrance is 8 km southwest on the left. From Hwy 93, turn onto Jaffray-Baynes Lake Road. Turn left onto Kikomun-Newgate Road. The park entrance is 400m west on the left.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/kikomun-creek-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483582,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648,-2147483645,-2147483644]},{"resourceLocationId":-2147483590,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Kleanza Creek","fullName":"Kleanza Creek Provincial Park","description":"Kleanza Creek Provincial Park is located amongst the forests and rock canyons in the Coast Mountains, 15 km east of Terrace's Hwy 16 and Hwy 37 junction. Occupying frontage on the Skeena River and on both sides of Kleanza Creek, Kleanza means gold in the Gitxsan language and it was this metal that influenced the early history of the park site.","drivingDirections":"15 km east of Terrace’s Hwy 16 and Hwy 37 junction.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/kleanza-creek-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483581,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648]},{"resourceLocationId":-2147483589,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Kokanee Creek","fullName":"Kokanee Creek Provincial Park","description":"With over a kilometre of sandy beaches and two campgrounds, Kokanee Creek Provincial Park is popular for locals and tourists alike coming to the West Kootenays. There is always lots to do with an adventure playground, visitor centre, spawning channel, boat launch, group camp site, viewing platform, hiking trails and a marina nearby. Within an hour's drive you can explore historic Nelson, Ainsworth Hot Springs, Balfour Golf Club, Kaslo with the SS Moyie stern wheeler and finally Kokanee Glacier Provincial Park. Special Features: Kokanee Creek canyon and old growth western cedar and grand fir.","drivingDirections":"In southern BC on Hwy 3A, a 20-min drive, 19 km east of Nelson or if you travel west take the Kootenay Lake ferry form Crawford Bay to Balfour. From Balfour it's another 15 km to the park.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/kokanee-creek-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483580,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648,-2147483647,-2147483644]},{"resourceLocationId":-2147483588,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Kokanee Glacier","fullName":"Kokanee Glacier Provincial Park","description":"There are 10 wilderness, walk-in campsites at the Kaslo Lake Campground.  There are also toilet and food storage facilities.  If you require information regarding winter accommodation, please contact the Alpine Club of Canada (403-678-3200 or <a href='http://www.alpineclubofcanada.ca/'>http://www.alpineclubofcanada.ca/ </a> ) to reserve a cabin in the park. Kokanee Glacier, Woodbury and Silver Spray cabins are maintained by the Alpine Club of Canada, on behalf of BC Parks.","drivingDirections":"Kokanee Glacier Provincial Park is located in the Selkirk Mountains, between Slocan and Kootenay Lakes. These roads may not be suitable for low-clearance vehicles: From Hwy 3A, 19 km northeast of Nelson, drive up Kokanee Creek for 16 km to Gibson Lake; From Hwy 31, 10 km north of Ainsworth, drive up Woodbury Creek for 13 km to the trailhead; From Hwy 6, 8 km south of Slocan, drive up Lemon Creek for 16 km to the trailhead.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/kokanee-glacier-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483579,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483641]},{"resourceLocationId":-2147483586,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Lac La Hache","fullName":"Lac La Hache Provincial Park","description":"Lac La Hache is one of the most popular recreation lakes along Highway 97. Set amongst a stately Douglas-fir forest, the cool, green conifers shade campers from the hot Cariboo sun. Lac La Hache Park is located on Highway 97, 13 km north of the community of Lac La Hache. Established in 1956, with 15 of the 83 campsites being reservable, flush toilets, tap water, a sani-station and a self-guided nature trail, Lac La Hache Park is a very pleasant campground. The day use area is located across Highway 97 on the shore of Lac La Hache and has an adventure playground, picnic tables, picnic shelter, boat launch, developed beach, change house and flush toilets.","drivingDirections":"The park is 13 km north of Lac La Hache community on Highway 97. The closest communities, towns and cities are Lac la Hache and 100 Mile House.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/lac-la-hache-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483571,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648,-2147483640]},{"resourceLocationId":-2147483585,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Lac Le Jeune","fullName":"Lac Le Jeune Provincial Park","description":"Nestled among an open stand of lodgepole pine, spruce and fir, Lac Le Jeune Park appeals to campers and anglers seeking an easily-accessible getaway spot. The park offers a diverse assortment of recreational activities including swimming, fishing, boating, hiking, biking, and nature appreciation. The campground serves as a base for recreational use at both Stake and Walloper Lakes. The park sees high use during the summer season. During the winter the area is used for cross-country skiing with no vehicle access. \nSpecial Feature: The park land addition in 1996 protects large marsh areas.","drivingDirections":"Take the Lac Le Jeune Exit off Hwy 5 (the Coquihalla) at 37 km south of Kamloops/47 km north of Merritt. There is also 26 km of paved access off the Hwy 1 at Kamloops. Due to its elevation, at 1,280 metres, the weather is cooler, a welcome relief from the desert conditions of the valleys to north and south.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/lac-le-jeune-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483570,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648]},{"resourceLocationId":-2147483584,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Lakelse Lake","fullName":"Lakelse Lake Provincial Park","description":"Lakelse Lake Provincial Park is situated in the Skeena River Watershed and is surrounded by the mountains of the Kitimat Range. The park preserves stands of impressive old growth cedar, hemlock and Sitka spruce forests which thrive in the moist air swept in from the Pacific Ocean. Salmon-bearing streams, sandy beaches, water sports and wildlife are some attractions this park offers.","drivingDirections":"Approximately 20 km south of Terrace and 40 km north of Kitimat on Highway 37. Located approximately 2.5 km north of the Mount Layton Hotsprings. From the junction of Highway 37 and 16, it is 14 km to Gruchy's Beach day use-area, 15 km to the Lakelse Lake picnic site and group site and 19 km to Furlong Bay Campground.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/lakelse-lake-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483569,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648,-2147483644]},{"resourceLocationId":-2147483583,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Liard River Hot Springs","fullName":"Liard River Hot Springs Provincial Park","description":"Relaxation seeps into your body as you ease into the second largest hot spring in Canada. Liard River Hot Springs provides relief to travelers after a long day on the road. The hot springs are of national ecological significance and are well known for their natural setting in a lush boreal spruce forest. The park is such a popular stop over for tourists that the campground fills up early each day during the summer months, though Liard River Hot Springs are open year round. There is a hot spring with water temperatures ranging from 42 - 52 degrees C. A boardwalk, which leads to the pool, passes through a warm water swamp and boreal forest which supports rich and diverse plants and animals. Watch for moose feeding in the warm water swamps. Due to the lush plant life influenced by the warmth of the springs, the area was originally known as the \"Tropical Valley\".","drivingDirections":"Located at kilometer 765 of the Alaska Highway, approximately 60 km north of Muncho Lake Provincial Park.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/liard-river-hot-springs-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483568,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648,-2147483647]},{"resourceLocationId":-2147483582,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Little Qualicum Falls","fullName":"Little Qualicum Falls Provincial Park","description":"A favourite destination on Vancouver Island is Little Qualicum Falls Provincial Park, which straddles the Little Qualicum River and incorporates the entire southern shore of Cameron Lake.\nImpressive waterfalls cascade down a rocky gorge in a beautiful forested setting bordered by steep mountain peaks at this park, one of the most beautiful parks on central Vancouver Island. The falls, lake swimming, shaded riverside trails and picnic facilities make Little Qualicum Falls a very popular family recreation destination. A number of walking trails are available in and around the park, offering picturesque views of the river and providing access to the upper and lower falls. \nCameron Lake is an ideal spot for swimming and fishing, as well as sail boarding, due to a wind funnel created by the surrounding mountains. The Cameron Lake and Beaufort day-use areas are located 10 minutes west of the campground on Highway 4.","drivingDirections":"The Little Qualicum Falls campground and day-use area is located 19 km west of Parksville on central Vancouver Island, on Highway 4. The Cameron Lake day-use area is located 23 km west of Parksville on Highway 4. The Beaufort day-use area is located 25 km west of Parksville on Hwy 4. Nearby communities include: Coombs, Parksville, Qualicum, Port Alberni.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/little-qualicum-falls-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483567,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648]},{"resourceLocationId":-2147483502,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Lockhart Beach","fullName":"Lockhart Beach Provincial Park","description":"<p>Located 40 km north of Creston on Highway 3A, this park and adjacent Lockhart Creek Provincial Park extend from the sunny shores of Kootenay Lake to the headwaters of Lockhart Creek.</p>\r\n\r\n<p>This small park provides the only easy access to public camping along the south arm of Kootenay Lake. An 18 site campground and day-use area are located near a sand and fine gravel beach where visitors can relax and enjoy the clear waters of Kootenay Lake.</p>","drivingDirections":"This park is located 40 km north of Creston on Highway 3A or 19 km south of Crawford Bay on Highway 3A. Located on the east side of Kootenay Lake with Crawford Bay and Creston being the closest communities.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/lockhart-beach-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483439,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648]},{"resourceLocationId":-2147483581,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Loveland Bay","fullName":"Loveland Bay Provincial Park","description":"For a more intimate camping experience visit Loveland Bay, a small, rustic provincial park that provides camping and boat launching directly onto Campbell Lake. Loveland Bay is a convenient base camp for day tripping to attractions in the nearby communities of Campbell River, Gold River, Sayward, Kelsey Bay and Quadra and Cortes Islands.\nIf you don't want to leave Loveland Bay's peaceful setting, you can spend the day water-skiing, fishing, canoeing or kayaking. Or just relax and work on your tan in between dips in the sun-kissed lake.\nLoveland Bay Provincial Park is located near Campbell River on central Vancouver Island and offers a quiet area for camping, swimming and fishing.","drivingDirections":"Loveland Bay is located west of Campbell River on central Vancouver Island. Access is from Hwy 28, 4 km west of Campbell River. Take the turnoff to Elk Falls viewpoint and Loveland Bay. Drive past Elk Falls and over the dam, then take the first road on the left. Follow the gravel road 12 km to Loveland Bay.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/loveland-bay-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483566,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648,-2147483644]},{"resourceLocationId":-2147483580,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Mabel Lake","fullName":"Mabel Lake Provincial Park","description":"Well off the beaten track, nestled in a beautiful mountain setting are the quieter, sandy beaches of Mabel Lake Provincial Park. Lush forests offer a pleasant retreat from the more crowded urban centres. The park's sandy shoreline is backed by a cool forest of hemlock, red cedar and birch, in sharp contrast to the drier ponderosa pine/Douglas-fir forests to the west. Squirrels often visit the campsites and painted turtles can be seen at Taylor Creek. Deer, black bear and even moose can be seen occasionally as well as a variety of birdlife and water fowl. Mabel Lake is a fisherman's destination park as several local fishing derbies are held in the park each year.  It is not uncommon to find a handful of fisherman enjoying the peaceful spring months, fishing off the beach.  Opportunities for rainbow trout are available here year round.","drivingDirections":"Take Hwy 6 east from Vernon to Lumby. Follow signs in Lumby turning north onto Mabel Lake Road that follow the Shuswap River for 36 kilometers on paved road through a picturesque landscape of farmland and ranches and 1 kilometer of gravel road to Mabel Lake and the campground. The total distance from Vernon is 60 kilometers.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/mabel-lake-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483560,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648,-2147483644]},{"resourceLocationId":-2147483579,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Main Lake","fullName":"Main Lake Provincial Park","description":"<p>Main Lake Provincial Park on Quadra Island encompasses six lakes and protects a biologically diverse freshwater system that includes more than 72 bird species and 234 plant species.</p>\n          <p>It is located on east-central Quadra Island off Village Bay Road and Surge Narrows Road. Visitors can reach Quadra Island via BC Ferry service from Campbell River on central Vancouver Island. While the park may be accessed by vehicle via ferry/highway, it is best enjoyed by canoe, kayak or small boat.</p>\n          <p>Visitors to the park can see a variety of wildlife, including wolves, cougars, owls, Bald eagles, hawks, osprey, Peregrine falcons and wintering swans. The geography of park is exceptional, with spectacular physical features such as narrow channels, limestone sinkholes, waterfalls and the close proximity of marine and fresh water ecosystems.</p>\n          <p>The Main Lake chain of interconnected lakes forms the largest freshwater waterway in the Gulf and Discovery Islands. Main Lake, Village Bay Lake and Mine Lake are connected by narrow, shallow marshes navigable by canoes, kayaks and small boats only. </p>\n          <p>A 7.5kw (10hp) restriction is in place on Main Lake and Mine Lake, as well as outside the park on Village Bay Lake.</p>\n          <p>An electric motors only restriction is in place on Little Main Lake, Stramberg and Clear Lake.</p>\n          <p>Please camp in designated campsites only.</p>\n          <p>Any water found in the park must be boiled, treated or filtered prior to consumption.</p>\n          <p>Please practise \"Leave No Trace\" camping ethics.</p>","drivingDirections":"Main Lake Provincial Park is located on east-central Quadra Island. Visitors can reach Quadra Island via BC Ferry service from Campbell River on central Vancouver Island. While the park may be accessed by vehicle via ferry/highway, it is best enjoyed by canoe, kayak or small boat. The closest communites are Heriot Bay, Quadra Island and Campbell River.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/main-lake-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483559,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483641]},{"resourceLocationId":-2147483578,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Martha Creek","fullName":"Martha Creek Provincial Park","description":"Great fishing, a wharf, paved boat launch and campsites on the reservoir are four lures that make this park popular with local anglers. The only provincial park on the Revelstoke reservoir, it hosts one of the few sandy beaches in the area and provides playground opportunities including an adventure playground, indoor cook shelter and a large picnic field complete with volleyball net.","drivingDirections":"Located in the southern interior of BC, on the western shore of the Revelstoke reservoir, a 15 min drive, 20 km north of Revelstoke on Highway 23.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/martha-creek-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483558,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648,-2147483640]},{"resourceLocationId":-2147483577,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"McDonald Creek","fullName":"McDonald Creek Provincial Park","description":"Situated just south of Nakusp, McDonald Creek Park is one of a system of four provincial parks on the Arrow Lake reservoir. With facilities on the eastern shoreline, it is a holiday destination for swimming, boating, jet skiing, water skiing and fishing opportunities. It features several kilometres of fine sandy beach, water front sites and open grassy meadows. You can always find a quiet spot for yourself, try some beachcombing or join in the fun at the main swimming area. A boat launch is available offering good fishing opportunities for kokanee, bull and rainbow trout - a tempting invitation for anglers of all ages.\n\nThe Arrow Reservoir bisects McDonald Creek Provincial Park and protects lakeshore riparian habitat on the east side and forested upland habitat on the west side. This combination offers outdoor recreational opportunities in a unique forested/lakeside setting.","drivingDirections":"Located in the southern interior of BC, on the east and west shores of the Upper Arrow Lake, 10 km south of Nakusp on Highway 6. The park facilities are only in the eastern section of the park.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/mcdonald-creek-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483557,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648]},{"resourceLocationId":-2147483576,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Meziadin Lake","fullName":"Meziadin Lake Provincial Park","description":"Meziadin Lake is a favourite destination of travelers and regional residents alike. Located a two hour drive north of Kitwanga, Meziadin Lake Park is an excellent destination base campsite for exploring this northern region of B.C.\n\n          Take a day trip to the Bear Glacier or visit the mining towns of Stewart, B.C. and Hyder, Alaska.  Recreation Services offered in this park include: guided angling, lake tours, and glacier tours.","drivingDirections":"155 km North of Kitwanga on Highway 37, just South of Meziadin Junction and 50 km East of Stewart.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/meziadin-lake-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483556,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648]},{"resourceLocationId":-2147483575,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Miracle Beach","fullName":"Miracle Beach Provincial Park","description":"Miracle Beach is a popular destination campground. A vast, family-friendly sandy beach on the ocean is the main attraction at this park. Miracle Beach also features well-spaced private campsites, group camping facilities, an adventure playground for children, hot showers, some flush toilet buildings, a large picnic area overlooking the water, a series of trails winding through lush forest and a large Nature House that offers daily interpretive talks and family events during peak season. At low tide, the beach features rich tide pools, perfect for observing a variety of marine life. On the beach, sandcastle building, sunning, swimming, exploring tide pools or just frolicking along the shore are all part of the Miracle Beach experience. Located on the waterfront midway between Courtenay and Campbell River, this park provides easy access to both communities and a wealth of entertainment... It also serves as a great base camp for day trips to nearby Denman and Hornby Islands. Nearby you'll find horseback riding, golf, fishing and numerous other recreational activities. If you’re at the park in June, be sure to catch the non-competitive annual sandcastle building day, where people of all ages create fantastic sculptures for all to enjoy.","drivingDirections":"Miracle Beach Provincial Park is located 22 km north of Courtenay and 22 km south of Campbell River off Hwy 19a. From Hwy 19 take exit 144 (Hamm Road) to Hwy 19a (the Oceanside Route). Head north a short distance to Miracle Beach Drive, then drive 2 km straight into the park. Nearby communities include: Campbell River, Comox Valley, Merville.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/miracle-beach-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483555,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648,-2147483647,-2147483644,-2147483640]},{"resourceLocationId":-2147483574,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Moberly Lake","fullName":"Moberly Lake Provincial Park","description":"Moberly Lake Provincial Park is situated on the southern shore of Moberly Lake which is situated on the boundary between the Rocky Mountain foothills to the west and the Peace plateau to the east. The lake itself lies in a broad shallow valley of the Moberly River, about 96 km from its junction with the Peace River. Enjoy a leisurely stroll along the lakeshore and pull up a bench to watch the sunset. Stop and visit the park's interpretation kiosk to learn about the local flora, fauna and history. While you are there, take time to listen to the loons or look overhead for bald eagles. Head down to the lake for a swim or to test your luck fishing for northern pike, bull trout, lake trout and lake whitefish.","drivingDirections":"Located approximately 25 kilometers northwest of Chetwynd on Highway 29, 3 km gravel road access.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/moberly-lake-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483554,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648,-2147483640]},{"resourceLocationId":-2147483573,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Monashee","fullName":"Monashee Provincial Park","description":"Established backcountry camps are available in four areas of the Park, and are open year round if accessible.\n          Spectrum Lake is the largest camp in the Park, located 6 km from the Spectrum Creek trailhead. There are 16 sites spread out along the lakeshore and up-slope towards the Ranger Cabin. Each site has a ten foot by ten foot wooden platform or framed earth pad, a fire ring and a picnic table. Some sites along the lake also have a small wooden shelter and a picnic table. A metal bear pole is located at each end of the campground for stringing up food and backpacks.  There are 5 pit toilets located throughout the camp. Spectrum Lake Group Campsite is found 100m further along the Spectrum lakeshore on the northeast side of the lake. There is a large covered picnic table shelter offering a place to keep dry, although it does not have a stove. There are four double and four single tent pads, as well as a pit toilet and metal bear cache/box. Big Peters Lake is the largest of three alpine camps with 10 wooden platforms or framed earth pads for camping. Little Peters Lake and Margie Lake camps each have 2 framed earth tent pads.  All camps have a toilet.  Margie and Big Peters Lakes also have a metal bear pole. Camping is permitted outside of these established areas, however campers must practice leave-no-trace principals.","drivingDirections":"111 km north of Vernon. Take hwy #97 to Vernon, then go east on Hwy #6 from Vernon for 47 km, through Lumby to Cherryville. Turn north onto Sugar Lake Road and proceed 46 km until you reach the turnoff (km marker #22) to the park. Proceed on Spectrum Creek Road for 16 km to the park. An alternative access to the Park is from the Arrow Lakes side. Follow highway 23 south from Revelstoke to Shelter Bay Forest Service Road (FSR) and turn right. This active logging road is steep and narrow in sections. Follow the Sol Mountain Lodge signs. At kilometre 35 turn right onto North Fosthall Creek FSR, keeping right, for approximately 17 kilometres. The North Fosthall Creek trail starts at the end of the road. The trail may not be well defined and is not regularly maintained. This access should be attempted by experienced backcountry travelers only. The majority of this road access is maintained by Sol Mountain Lodge.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/monashee-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483553,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483641]},{"resourceLocationId":-2147483572,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Monck","fullName":"Monck Provincial Park","description":"Set on the shore of Nicola Lake, Monck Provincial Park offers a wide assortment of recreational activities including camping, picnicking, swimming, fishing, boating, water-skiing, wind-surfing and hiking. A very popular family-oriented campground in a hot, dry setting this park has very high use during the summer season. In addition to providing recreational opportunities, Monck protects a ponderosa pine, bunchgrass ecosystem and a volcanic rock cliff landscape.","drivingDirections":"On the western shore of Nicola Lake, 22 km north of Merritt, 12 km off Hwy 5A via narrow paved road.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/monck-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483552,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648,-2147483647]},{"resourceLocationId":-2147483571,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Montague Harbour Marine","fullName":"Montague Harbour Marine Provincial Park","description":"Montague Harbour Marine Provincial Park on peaceful Galiano Island is rich in natural and cultural history. White shell beaches, open meadows, tidal lagoons, towering forests, craggy headlands and abundant bird life are just a few of the things that attract visitors to this park in the southern Gulf Islands.\nThe park starts five meters below sea level and climbs 180 meters to a steep rocky precipice. Visitors can moor their boats to one of the 40 buoys in sheltered Montague Harbour or come by ferry and camp in one of the scenic vehicle-accessible or walk-in campsites. The park is the perfect place to enjoy a picnic or afternoon of exploration. Located within the park is Gray Peninsula, which was inhabited by First Nations peoples before the arrival of Spanish explorer Dionisio Galiano in 1792. Skirting the northwest edge of the peninsula is a spectacular rock ledge that was carved into rippling patterns by the movement of glaciers thousands of years ago.\n<br> <br> <b> Note: </b> Please note that campsites at Montague Provincial Park were re-numbered in Spring 2018 due to campground expansion and improvements.","drivingDirections":"Montague Harbour Marine Provincial Park is located on the southwest side of Galiano Island approximately 10 km northwest of Sturdies Bay. BC Ferries provides vehicle and passenger service to Sturdies Bay from Swartz Bay on Vancouver Island and from Tsawwassen, south of Vancouver. The park is located on Montague Park Road; follow signs to the park from the ferry terminal. Boaters can reference marine chart 3442, 3462, 3463 and 3473 for more information on this area. Nearby communities include: Galiano Island, Saltspring Island, Victoria, Sidney, Vancouver.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/montague-harbour-marine-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483551,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648,-2147483647,-2147483644]},{"resourceLocationId":-2147483570,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Morton Lake","fullName":"Morton Lake Provincial Park","description":"There is a reason the area northwest of Campbell River is called \"lake country,\" that visitors to Morton Lake Provincial Park are sure to discover. From April to June and September to October, lake fishing for Rainbow, Cutthroat and Dolly Varden trout on Mohun Lake in the park can be excellent. While this park is popular with anglers, there is still plenty to do if fishing isn't your favourite pastime. During the summer, visitors can fill their days swimming, canoeing, boating or just lounging on the sandy beach at Morton Lake.\nToday little sign can be found of a devastating fire that burned more than 30,000 hectares of forest surrounding Morton Lake to the ground in 1938. The fire, which burned for more than one month, inspired a massive replanting effort the following year, during which 800,000 Douglas fir trees were planted in one month an incredible accomplishment in those days.\nMorton Lake Provincial Park, which includes all of Morton Lake and a section of shoreline on neighbouring Mohun Lake, provides access to the popular Sayward Canoe Route a 47-kilometer paddle and portage circuit. The park offers lake-front camping, as well as a boat launch, pit toilets, a short hiking trail to tranquil Andrew Lake and a large picnic/day-use area.","drivingDirections":"Morton Lake Provincial Park is located 27 km northwest of Campbell River in the Sayward Forest. The easiest way to reach Morton Lake is via Hwy 19. Turn off at the Menzies Main logging road, approximately 10 minutes past the pulp mill. Follow the gravel Menzies Main for 12 km, then take Morton Lake Road for another 7 km to the park.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/morton-lake-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483550,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648]},{"resourceLocationId":-2147483565,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Moyie Lake","fullName":"Moyie Lake Provincial Park","description":"Located 20 kilometers south of Cranbrook off Highway 3 and 95, Moyie Lake Park day use area, boat launch and 111 site campground provides the only public access to the deep blue mountain waters of Moyie Lake.\nThis vacation friendly park features 1300 metres of developed sandy beach backed by a large grassy area. Swimming, wind surfing, sailing, boating, wildlife and bird viewing and a variety of fishing experiences enhance Moyie Lake Park. As well, an adventure playground and hot showers are on site.","drivingDirections":"Approximately a 20 km (15 minute drive) south of Cranbrook on Highway 3 and 95. The small community of Moyie is located 5 km south of Moyie Lake Provincial Park.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/moyie-lake-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483545,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648]},{"resourceLocationId":-2147483569,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Mount Assiniboine","fullName":"Mount Assiniboine Provincial Park","description":"Mount Assiniboine Provincial Park is a magnificent place of shimmering lakes, glistening glaciers, sky scraping peaks and sun-dappled alpine meadows. World renowned Mount Assiniboine, at an elevation of 3,618 metres, is situated along the continental divide near the south east corner of the park and has defined mountain splendour in the Canadian Rockies for over 100 years.           <br/><br/>           No roads penetrate this unspoiled wilderness, with trails providing the only land access. Camping, hiking, mountain climbing and viewing spectacular mountain scenery are the main activities here, as well as fishing, horseback riding, and ski touring in winter. ","drivingDirections":"<br/>The core area of Mount Assiniboine Provincial Park is a remote area with several options for access.  The most commonly used hiking trailheads include Mount Shark (Kananaskis Country) ~ 25km, Sunshine Village (Banff) ~ 30k.  Helicopter Access Service is organized through Mount Assiniboine Lodge (403.678.2883) every Wednesday, Friday & Sunday (service is moved from Sunday to Monday on Holiday Weekends).","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/mount-assiniboine-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483549,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483642]},{"resourceLocationId":-2147483568,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Mount Fernie","fullName":"Mount Fernie Provincial Park","description":"Proximity to City of Fernie which offers such amenities as golfing, restaurants and art galleries. This area is also popular for mountain biking and the opportunity for fishing in the nearby Elk River.","drivingDirections":"Located 3 km south of Fernie on Hwy 3.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/mount-fernie-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483548,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648]},{"resourceLocationId":-2147483567,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Mount Robson","fullName":"Mount Robson Provincial Park","description":"Mount Robson Provincial Park, the second oldest park in British Columbia's park system, is truly one of the world's crown jewels. The mountain for which the park is named guards the park's western entrance. At 3,954 meters, Mount Robson, the highest peak in the Canadian Rockies, towers over the lesser surrounding peaks. Winter or summer, this is one of the finest views in the Rocky Mountains. Just as the early trappers, hunters and explorers felt in awe at the mountain's magnificence, travelers today experience the same feelings.","drivingDirections":"The park is located in east, central British Columbia, just west of the British Columbia and Alberta border and Jasper National Park. Approximately 4 hours north of Kamloops, BC on Highway 5; 3.5 hours east of Prince George, BC on Highway 16; and 5 hours west of Edmonton, Alberta on Highway 16. The closest communities to this park are Valemount, Tete Jaune Cache and McBride.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/mount-robson-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483547,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648,-2147483644]},{"resourceLocationId":-2147483499,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Muncho Lake","fullName":"Muncho Lake Provincial Park","description":"<p>Only a few minutes from the Alaska Highway that passes through the park is the serenity and seclusion expected in this area of the north. Some of the most outstanding views of natural beauty anywhere can be experienced at this park. Spectacular folded mountains, bountiful wildlife, brilliantly-colored wildflowers are just a few of the wonders to discover here. In the southern portion of the park, you will see the very impressive geological formations of Folded Mountain towering above the road. Tectonic deformations have folded the limestone giving these mountains their unique appearance. Further along the highway you will have the opportunity to travel across the alluvial fans. Caution should be used if investigating these wonders of nature. Rain high up in the mountains may cause flooding of these areas with little or no warning. Keep an eye open for moose which frequent the many swamps within the park.</p>\r\n\r\n<p>Twelve kilometres of jade-colored water will tell you that you have reached Muncho Lake. You have the choice of camping at Strawberry Flats campground or at MacDonald campground, 11 km further north. The lake’s cold, deep waters, tinted green by minerals, are home to lake trout, arctic grayling, bull trout and whitefish. Toss out a line and try your luck.</p>\r\n\r\n<p>There is an excellent chance you will see stone sheep along the highway. Be sure to check your rear-view mirror before hitting the brakes and give motorists’ ample warning of your intention to stop. The natural beauty of Muncho Lake Provincial Park is sure to be the highlight of your northern adventure.</p>\r\n\r\n<p>Established Date: May 31, 1957\r\nPark Size: 88,420 hectares</p>\r\n\r\n<p>BC Parks is committed to reconciliation with Indigenous peoples\r\nAlthough this webpage may not adequately represent the history and relationship of Indigenous peoples to this area, we are working in partnership with First Nations to update this information and better reflect these deep connections to the land. To learn about Indigenous territories in BC, see the First Peoples’ Language Map which also shows the locations of all BC Parks.</p>","drivingDirections":"Located 341 Kms West of Ft Nelson, Drive North on the Alaska Highway for 3 hours.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/muncho-lake-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483437,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648]},{"resourceLocationId":-2147483504,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Norbury Lake","fullName":"Norbury Lake Provincial Park","description":"<p>The Steeples, a distinctive feature of the Hughes Range of the Rocky Mountains, stands clear against the sky to the east of this lightly wooded area.</p>\r\n\r\n<p>Just south of Fort Steele, the park encompasses Peckham’s Lake and fronts on Norbury Lake. Beach areas, water sports and pleasant walking trails. Rainbow trout in Peckham’s Lake.</p>\r\n\r\n<p>Power boats are prohibited. The Kootenay Fish Hatchery at Wardner is a short distance away.</p>","drivingDirections":"18 km. north from Hwy 3 and 16 km south from Hwy 93/95 near Cranbrook.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/norbury-lake-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483441,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648]},{"resourceLocationId":-2147483562,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"North Thompson River","fullName":"North Thompson River Provincial Park","description":"A lovely campground situated at the confluence of the Clearwater and North Thompson Rivers. Popular with travellers on Hwy 5, with young families, or as a base camp for visitors exploring Wells Gray Park and the Clearwater area.","drivingDirections":"Located 5 km south of Clearwater, just off Hwy 5.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/north-thompson-river-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483542,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648]},{"resourceLocationId":-2147483564,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Nairn Falls","fullName":"Nairn Falls Provincial Park","description":"Just 20 minutes north of Whistler is Nairn Falls Park. This park provides a good base camp for exploring Whistler, the Pemberton Valley or nearby Garibaldi Provincial Park. It is an excellent overnight stop before continuing onto the Duffey Lake Road or points north or south. The falls are 60 m high and a 1.5 km hiking trail will take you to the viewpoint.","drivingDirections":"Off Hwy 99, approximately 92 km north of Squamish, 32 km north of Whistler.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/nairn-falls-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483544,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648]},{"resourceLocationId":-2147483522,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"sx̌ʷəx̌ʷnitkʷ (Okanagan Falls)","fullName":"sx̌ʷəx̌ʷnitkʷ Provincial Park (Okanagan Falls)","description":"<p>In March 2015, the park was renamed to reflect the traditional Okanagan First Nation name.</p>\n          <p>Located just above the Okanagan River, cool deciduous trees provide a contrast to the parched hills above. This oasis is famous among naturalists for its superb bird watching, wildlife viewing, nature study, photography opportunities and a variety of bats.</p>\n          <p>A lovely array of colours occurs in autumn. The diverse recreational opportunities will please nature lovers, campers and fishing enthusiasts alike. The park is a popular base camp for cyclists and climbers.</p>","drivingDirections":"Located on Green Lake Road, approximately 500 metres from the junction of Hwy. 97 and Green Lake Road. Use caution, narrow road with blind corner. At the town of Okanagan Falls.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/sxwexwnitkw-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483478,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648]},{"resourceLocationId":-2147483561,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Okanagan Lake North","fullName":"Okanagan Lake North Provincial Park","description":"Beautiful, sandy/pebbly beaches surrounded by ponderosa pine and sagebrush make this park the perfect spot for swimming and water activities. At the two large campgrounds in the park, panoramic views, picnic sites and interpretive programs which run from late June through Labour Day weekend, will add to your enjoyment. The landscape across the lake, from beach to skyline, is part of Okanagan Mountain Provincial Park, accessible by boat or by driving back through Kelowna.","drivingDirections":"Located 11 km North of Summerland on Hwy 97.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/okanagan-lake-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483535,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648,-2147483647]},{"resourceLocationId":-2147483560,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Okanagan Lake South","fullName":"Okanagan Lake South Provincial Park","description":"Beautiful, sandy/pebbly beaches surrounded by ponderosa pine and sagebrush make this park the perfect spot for swimming and water activities. At the two large campgrounds in the park, panoramic views, picnic sites and interpretive programs which run from late June through Labour Day weekend, will add to your enjoyment. The landscape across the lake, from beach to skyline, is part of Okanagan Mountain Provincial Park, accessible by boat or by driving back through Kelowna.","drivingDirections":"Located 11 km North of Summerland on Hwy 97.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/okanagan-lake-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483534,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648,-2147483647]},{"resourceLocationId":-2147483559,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Otter Lake","fullName":"Otter Lake Provincial Park","description":"If you're looking for privacy in a natural setting, Otter Lake is ideal for old-fashioned camping. The park has two locations, a main picnic and day-use area in Tulameen and a lovely lakeside campground about 5 km further north along the road. The Cascade Mountain Range surrounds the park and includes awesome canyons and clear flowing streams. Large numbers of otter, beaver and red squirrel inhabit the area, as well as, mountain goats, cougars and grizzly bears. Fishermen will find time spent on Otter Lake rewarding, with large lake trout being the catch of the day. The scenic lakeside campground is an ideal base for those who want to explore the mining history of the Tulameen area.","drivingDirections":"The park is located 33 km northwest of Princeton off Hwy 5A toward Coalmont and Tulameen and the route is well marked with signs. There is also access from Hwy 97C, Coquihalla Connector Hwy.- turn at Aspen Grove, which is Hwy 5A, and follow signs. A 34 km gravel road leaves Hwy 5A just past the Kentucky-Alleyne turnoff. It leads through sections of the Nicola Ranch to approach Otter Lake from the north. The roads, both from Tulameen and the gravel road from the north, are narrow and winding with limited visibility. Use caution and yield to logging trucks.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/otter-lake-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483530,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648]},{"resourceLocationId":-2147483558,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Paarens Beach","fullName":"Paarens Beach Provincial Park","description":"Welcome to Paarens Beach Provincial Park. Situated on the south-west shore of beautiful Stuart Lake, Paarens Beach is a delightful small provincial park that few people outside of the area seem to know about. With an uncrowded campground, large beach and boat launch, it is an ideal base from which to explore the rich history and enjoy the multitude of recreational opportunities around Stuart Lake and the nearby community of Fort St. James.","drivingDirections":"Paarens Beach is located less than a two-hour drive northwest of Prince George on the south shore of Stuart Lake and about 11 kilometres from the community of Fort St. James. From Prince George take Highway 16 west one hundred kilometres to Vanderhoof, at which point it is another 54 kilometres north on Highway 27.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/paarens-beach-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483529,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648]},{"resourceLocationId":-2147483557,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Paul Lake","fullName":"Paul Lake Provincial Park","description":"Paul Lake Provincial Park is nestled in a mixed forest of Douglas-fir, pine and aspen. The park offers a large campground, a sani-station and an adventure playground. In addition there is a popular day-use area with beach and cartop boat launch, and over seven kilometers of hiking trails. This lovely lakeshore campground is within a half-hour drive of Kamloops and there are many tourist attractions in the area.\n\n\t\t\t Easy access, beautiful scenery, plentiful fishing and a diversity of outdoor recreational activities make Paul Lake a popular destination.","drivingDirections":"From Hwy 5, five km north of Kamloops, take the paved Pinantan Road for 19 km to the campground, located on the north side of Paul Lake.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/paul-lake-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483528,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648,-2147483644]},{"resourceLocationId":-2147483556,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Peace Arch","fullName":"Peace Arch Provincial Park","description":"Peace Arch Provincial Park is unique in BC’s system of Provincial Parks. Its location abuts the 49th parallel, in southwestern British Columbia and is contiguous with and closely tied to the State of Washington’s Peace Arch State Park. Located at the Peace Arch Border crossing, where US Interstate 5 ends and BC Highway 99 begins, the park is the first thing vehicle travelers see as they enter Canada. The Peace Arch, for which the park is named, was dedicated in 1921. It is a monument celebrating both the 1814 signing of the Treaty of Ghent which ended the war of 1812 and established the boundaries between Canada and the United States, as well as a century of peace between neighbours that followed. With its formal lawns and gardens, this park is like no other in BC’s system of protected areas.","drivingDirections":"The park is about 40 km south of Vancouver and is situated on the International Boundary at the Douglas Border crossing. This is at the junction of Highway 99 in British Columbia and Interstate 5 in Washington.\r\n\r\nHours of operation: 8:00AM to 8:00PM","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/peace-arch-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483522,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483640]},{"resourceLocationId":-2147483555,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Pilot Bay","fullName":"Pilot Bay Provincial Park","description":"There are wilderness/walk-in campsites at the Pilot Bay Campground. There are fire rings and picnic tables at each site as well as two outhouses and a metal type food cache. This park is user-maintained and you must pack out what you pack in.","drivingDirections":"Off Hwy 3A, Balfour BC; a 10 minute drive south of Kootenay Bay ferry terminal. The closest community is Crawford Bay","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/pilot-bay-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483521,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483641]},{"resourceLocationId":-2147483553,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Pirates Cove Marine","fullName":"Pirates Cove Marine Provinicial Park","description":"There are designated walk-in campsites with tent pads in Pirates Cove, located just above the beach. Some of these sites have ocean views and facilities include a cold water hand pump (this water should be boiled, filtered or treated prior to consumption) and composting toilets. A backcountry camping fee is in place; self registration vaults are located near the water pump. Pirates Cove is accessible year round.","drivingDirections":"This park is marine accessible only. Adjacent to Pylades Channel on the southeast tip of DeCourcy Island. Beach area on Ruxton Passage-16 km southeast of Nanaimo on south Vancouver Island. It is accessible by boat through Dodd Narrows from Nanaimo up through the Gulf Islands from Victoria and Vancouver boaters would come through the Gabriola Passage. Boaters can reference marine chart #3475 for more information on this area. The closest communities are De Courcy Island, Nanaimo, Gabriola Island and Ladysmith.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/pirates-cove-marine-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483519,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483641]},{"resourceLocationId":-2147483552,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Plumper Cove Marine","fullName":"Plumper Cove Marine Provincial Park","description":"A snug anchorage on the northwest side of Keats Island. Accessible by passenger ferry from Langdale to Keats Landing and a 2 km walk to the park. A developed area with forested walk-in campsites, fire rings, water and a trail system. Marine facilities include a wharf and mooring buoys; small boats may be pulled up on the shore. The pebble beach is great for swimming and picnicking. Observatory Point provides views of Howe Sound and the town of Gibsons.","drivingDirections":"Located on the western shore of Keats Island, across the Shoal Channel from Gibsons. There are many floats and mooring buoys along with lots of room for anchorage.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/plumper-cove-marine-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483518,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483640]},{"resourceLocationId":-2147483551,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Porpoise Bay","fullName":"Porpoise Bay Provincial Park","description":"Porpoise Bay Provincial Park on the Sunshine Coast offers many opportunities for coastal fun and is a favourite family park. The park is separated from the Strait of Georgia by the isthmus at Sechelt. This park is characterized by second-growth forest, open grassy areas and sandy beaches. This park also makes an excellent base camp for paddlers exploring the Sechelt Inlet.","drivingDirections":"Located at the southern end of Sechelt Inlet on the Sunshine Coast, Porpoise Bay Provincial Park is 4 km north of Sechelt off Hwy 101. Vehicle access is via Sechelt Inlet Road northeast of Sechelt.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/porpoise-bay-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483517,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648,-2147483647,-2147483644,-2147483640]},{"resourceLocationId":-2147483550,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Porteau Cove","fullName":"Porteau Cove Provincial Park","description":"Situated on the most southerly fjord in North America, the park features waterfront campsites with a view over Howe Sound to the mountains beyond. An old ship has been sunk to provide interest for Scuba divers and to attract marine life. There are special facilities for divers. Adjacent train tracks are active and occasional noise disturbance may occur.","drivingDirections":"38 km north of Vancouver on Hwy 99, 20 km south of Squamish, 8.5 km south of Britannia Beach. Other nearby communities include Brackendale and Lions Bay.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/porteau-cove-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483516,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648,-2147483647]},{"resourceLocationId":-2147483549,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Premier Lake","fullName":"Premier Lake Provincial Park","description":"Nestled against the west slopes of the Rocky Mountains, Premier Lake is one of the key recreational fishing lakes in the East Kootenay. The emerald green lakes of Premier and four smaller lakes, Canuck, Yankee, Cats Eye and Quartz offer a unique and varied fishing experience in a secluded and pleasant park atmosphere.\n\nThe area is rich in wildlife. Premier Ridge, west of the lake, is an important wintering range for elk, whitetail and mule deer, and Rocky Mountain bighorn sheep. Forests of Douglas fir and western larch are common in the park. Osprey, eagle, heron, king fisher, numerous forest birds and water fowl can also be seen.\n\nPremier Lake Park, situated 72 km north of Cranbrook, contains 57 vehicle/tent camp sites and is located at the south end of the lake. There are no drive-through sites. There is an information shelter located at the entrance to the park but no telephone.","drivingDirections":"Access is from Highway 93/95, 72 km north of Cranbrook; the well marked turnoff leads east to a 12 km paved and gravel road to the park. The smaller communities of Skookumchuck - 12km south and Wasa 16km further south are nearest the park. The larger communities are Cranbrook, 72 km south, and Kimberley, 60 km northeast, of Premier Lake on Highway 93/95.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/premier-lake-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483515,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648]},{"resourceLocationId":-2147483548,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Prudhomme Lake","fullName":"Prudhomme Lake Provincial Park","description":"A small, forested lakefront campground only a short distance east of Prince Rupert. Nearby Diana Lake Provincial Park provides opportunities for a variety of day-use activities. \r\n<br>The campground gate is locked daily between 11:00pm and 7:00am. After-hours arrivals are not permitted within the park after the gate is locked.","drivingDirections":"16 km East of Prince Rupert on Hwy 16.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/prudhomme-lake-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483514,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648]},{"resourceLocationId":-2147483547,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Purden Lake","fullName":"Purden Lake Provincial Park","description":"Nestled in the rolling mountains east of Prince George, Purden Lake Provincial Park, on the north shore of Purden Lake, is dominated by the Cariboo Mountains to the south and the McGregor range of the Rockies to the north.","drivingDirections":"Purden Lake Park is located 64 km east of Prince George on the Yellowhead Highway #16.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/purden-lake-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483513,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648]},{"resourceLocationId":-2147483546,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Raft Cove","fullName":"Raft Cove Provincial Park","description":"Isolated Raft Cove Provincial Park on the northwest coast of Vancouver Island is wonderfully scenic, attracting wilderness adventurers on day hikes or backpackers carrying in overnight gear to set up camp on the long crescent shaped sandy beach. This undeveloped, rustic park features a long spit and sandy bay at the mouth of the meandering Macjack River, rocky headlands and a wild coastal environment. Visitors should dress warmly and bring good rain gear at any time of the year, as Raft Cove is extremely exposed to the Pacific weather systems that pound this rugged coastline. Waterproof clothing is a must if you hope to stay dry. Wilderness camping on the beach is popular at this park, as is surfing, fishing and hiking. During low tides, long shore walks over rock and beach can be made north or south of Raft Cove, at the edge of the pounding Pacific surf. Access to the beach from the road is via a rugged 2-km route that cuts through coastal old-growth forest of hemlock, western red cedar and Sitka spruce. This unmaintained route has some challenging sections and is extremely muddy in areas.","drivingDirections":"Raft Cove Provincial Park is located on the northwest coast of Vancouver Island, 65 km southwest of Port Hardy. Access to the park is by a gravel logging road out of Holberg. Follow the signs for Cape Scott Provincial Park and turn left on Ronning Main. Continue along Ronning Main to the parking area at approximately km 25. The access trail is located on the far west corner of the parking area. Drivers must be aware that these are active logging roads and precautions should be taken. Logging vehicles have the right of way. The closest communities are Port Hardy, Holberg and Winter Harbour.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/raft-cove-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483512,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483641]},{"resourceLocationId":-2147483545,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Rathtrevor Beach","fullName":"Rathtrevor Beach Provincial Park","description":"Majestic old growth trees, beautiful ocean sunsets and an inviting, wide sandy beach with campsites nestled amongst mature Douglas fir trees makes Rathtrevor Beach Provincial Park in Parksville one of the premier vacation destinations on Vancouver Island.         At low tide the ocean recedes almost a kilometer, providing an ideal place for visitors of all ages to play in the sand and explore the shoreline. When the tide rolls in over the sun-baked sand, the warmed water is unbeatable for swimming and salt water fun.         Rathtrevor Beach is ideal for a relaxed family outing. Simply sit back and soak up the seaside atmosphere or take a walk through the wooded upland area of the park. All campsites are within a 5-minute walk to the 2 km stretch of sandy beach.         The park also features a large day-use area, perfect for an afternoon picnic.","drivingDirections":"Rathtrevor Beach Provincial Park is located 3 km south of Parksville on Hwy 19a, on central Vancouver Island. Take exit 51 from the Inland Island Highway (Hwy 19) and follow signs to the park. The closest communities are Parksville, Qualicum and Nanaimo.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/rathtrevor-beach-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483511,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648,-2147483644,-2147483640]},{"resourceLocationId":-2147483544,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Red Bluff","fullName":"Red Bluff Provincial Park","description":"On Babine Lake near the community of Granisle, this popular park is named for the ironstained cliffs that plunge almost perpendicularly into the lake. Park visitors can swim, sunbathe, angle for a rainbow trout or take in the salmon enhancement projects at nearby Fulton River and Pinkut Creek. Boaters like to explore the extensive shoreline of Babine Lake, the longest natural fresh water lake in British Columbia.","drivingDirections":"At the Village of Topley on Hwy 16, go north for 45 km on Hwy 118.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/red-bluff-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483510,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648]},{"resourceLocationId":-2147483543,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Rolley Lake","fullName":"Rolley Lake Provincial Park","description":"Less than an hour's drive from Vancouver, Rolley Lake Provincial Park provides a quick escape from urban life. The park is a predominately flat, wilderness area blanketed with tall, second-growth conifers. The small, warm-water lake provides opportunities for swimming, fishing, and canoeing. Sixty-four campsites are nestled in the trees just minutes from the lakeshore. Visitors can also enjoy picnicking and short hikes.","drivingDirections":"Rolley Lake Provincial Park is 23 km (13.8 miles) northwest of Mission, BC. Take Highway 7 to Maple Ridge and turn north at 287th Street. Turn right onto Dewdney Trunk Road and then turn left onto Bell Road and drive north to the park.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/rolley-lake-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483509,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648]},{"resourceLocationId":-2147483542,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Rosebery","fullName":"Rosebery Provincial Park","description":"Rosebery Provincial Park is located just north of New Denver, on Highway 6. To the west, across Slocan Lake, is the magnificent Valhalla Provincial Park. Tucked along the banks of Wilson Creek, this park has an intimate, forested creek setting that offers secluded camping for overnight travellers or visitors seeking more adventure. It is a good staging area for backcountry exploration of nearby Valhalla, Kokanee Glacier and Goat Range Provincial Parks. Visitors can also explore the numerous ghost-mining towns nearby and after an exciting day, relax in the many commercial or undeveloped natural hot springs in the area.","drivingDirections":"Located in the southern interior of BC on Highway 6, this park is 5 km north of New Denver and 40 km south of Nakusp. It is situated on the banks of Wilson Creek on the east side of Slocan Lake.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/rosebery-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483508,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648]},{"resourceLocationId":-2147483541,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Ruckle","fullName":"Ruckle Provincial Park","description":"Ruckle Provincial Park is one of the most beautiful parks in the southern Gulf Islands. Pitch your tent in the grassy meadow overlooking Swanson Channel then lie back and relax, watching pleasure boats and ferries sail by in a stately and colourful parade. With its 7 kilometres of shoreline, rocky headlands and tiny coves and bays, Ruckle Park provides hours or even days of enjoyable exploration. A mixture of forest, field and shore habitats makes it one of the most productive wildlife viewing areas on Salt Spring Island. Watch for sea lions and killer whales out in the sea, and mink and river otter cavorting along the shoreline. Tidal pools are filled with a brightly-coloured world of crab, mussel, limpet, oyster, sculpin, starfish and more.","drivingDirections":"Located on Salt Spring Island in the southern Gulf Islands, Ruckle Provincial Park is situated 10 km from the Fulford Harbour ferry terminal along Beaver Point Road. BC Ferries offers service to Salt Spring Island from Victoria (Swartz Bay) and Crofton on Vancouver Island, and Vancouver (Tsawwassen). The closest communites are Ganges, Fulford Harbour, Salt Spring Island, Sidney and Victoria.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/ruckle-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483507,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648,-2147483647,-2147483644]},{"resourceLocationId":-2147483540,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Saltery Bay","fullName":"Saltery Bay Provincial Park","description":"Saltery Bay Provincial Park was established in 1962 to provide ocean access on the Sunshine Coast of Georgia Strait. The park is divided into two separate sites: the campground and the day-use area. The day-use area with its rocky beaches is a popular swimming and picnic site. Lush forests with large, old trees create a quiet setting for the campground at Mermaid Cove. At low tide, the rocky shoreline often has tidal pools with starfish, sea urchins, small fish and crabs. Scuba diving provides a close-up look at the abundant marine life and a 3-metre bronze mermaid statue.\n\n          The Emerald Princess statue and wheelchair access ramp were placed in the park through efforts of local scuba enthusiasts. From the shore, killer whales and sea lions can sometimes be seen.\n\n          Mounds of seashells called \"middens\" indicate that this was a traditional gathering area for First Nations.","drivingDirections":"The campground is approximately 1 km north of Saltery Bay ferry terminal on Hwy 101, 27 km south of Powell River.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/saltery-bay-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483506,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648]},{"resourceLocationId":-2147483539,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Sasquatch","fullName":"Sasquatch Provincial Park","description":"Located north of Harrison Hot Springs, Sasquatch Provincial Park is characterized by a series of pocket lakes, a unique second-growth and birch forest, and scenic mountain ridges. Hicks and Deer Lakes are ideal for motor-boating and canoeing while Trout Lake provides a tranquil fishing experience. Visitors can also enjoy camping, hiking, wildlife viewing, and picnicking.","drivingDirections":"Sasquatch Park is located off of Highway 7, six kilometers north of Harrison Hot Springs. Follow the signs through Harrison Hot Springs and Green Point.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/sasquatch-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483505,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648,-2147483644]},{"resourceLocationId":-2147483537,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Shannon Falls","fullName":"Shannon Falls Provincial Park","description":"Shannon Falls is composed of a series of cliffs, rising 335 meters above Highways 99, making it the third highest falls in the province, ranking behind 481 metre Della Falls in Strathcona Provincial Park on Vancouver Island and 396 metre Hunlen Falls in Tweedsmuir Provincial Park near Bella Coola.","drivingDirections":"The park is located just off of Highway 99, 58 km north of Vancouver and 2 km south of Squamish. Shannon Falls is immediately adjacent to Stawamus Chief Provincial Park. Squamish and Brittania Beach are the closest communities to the park.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/shannon-falls-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483503,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483640]},{"resourceLocationId":-2147483536,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Shuswap Lake","fullName":"Shuswap Lake Provincial Park","description":"A very popular destination, the park operates at capacity from early July to Labour Day (early Sept).\n\nThe park is situated on the old delta of Scotch Creek, has one kilometer of sandy, pebble beach, and includes the whole of Copper Island. The park also offers a large grassy play area, an adventure playground, a large boat launch. and a self-guiding nature trail.\n\nBoaters may wish to visit Copper Island, located two kilometres offshore. A 2.8 km hiking trail provides beautiful views of the area. Please note that overnight camping, including houseboats, and campfires are prohibited on the island.\n\nSupplies, groceries, and many recreational opportunities including bumper boats, mini-golf driving range, go-carts, para-sailing, horseback riding, whitewater rafting, boat and jet-ski rentals are offered by near-by businesses.","drivingDirections":"On the north shore of the main arm of Shuswap Lake, and includes Copper Island. Leave Hwy 1 at Squilax, and drive 19 km on paved roads. Note that Copper Island is only accessible by boat.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/shuswap-lake-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483502,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648,-2147483647,-2147483644]},{"resourceLocationId":-2147483535,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Silver Lake","fullName":"Silver Lake Provincial Park","description":"Situated in the scenic Skagit Valley, Silver Lake Provincial Park is a small, largely undeveloped lakefront area. Visitors can enjoy fishing, picnicking and boating (10Hp motor limit) against a spectacular mountain backdrop or take pleasure in a rustic camping experience.","drivingDirections":"The park is located 12 km southwest of Hope in the beautiful Skagit Valley. From the south: from Highway #1 watch for Silver/Skagit Provincial Park signs approaching Flood-Hope Road (Exit #168). Follow the blue park signs, turn right onto Flood-Hope Road, travel approximately 1 km to turn right on Silver Skagit Road. From the north: take either Exit #170 or #168 to Flood-Hope Road, and follow the signs to Silver Skagit Road. Travel this scenic route along the valley bottom, the first 2 km on pavement, the remainder on gravel. At 6 km watch for the park signs at a bridge on your right. Turn right and go over the bridge. It is 1 km in to the park.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/silver-lake-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483501,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648]},{"resourceLocationId":-2147483534,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Skagit Valley","fullName":"Skagit Valley Provincial Park","description":"Approximately two hours from the Greater Vancouver area, Skagit Valley is part of a larger protected area complex that includes the US North Cascades National Park and the Ross Lake and Lake Chelan National Recreation Areas. This large tract of territory contains the Ross Lake Reservoir, an important source of hydroelectricity for Seattle City Light.\n\n\t\t\t The Skagit Valley was carved by retreating glaciers and is characterized by excellent outdoor recreation opportunities in a natural, wilderness-like setting. Visitors can enjoy hiking along 50 km of trails, river fishing, camping, and picnicking.","drivingDirections":"From the community of Hope, travel westbound on Flood Hope Road, then turn left (south) onto the Silver Skagit Road to get to the park. Coming from the west on BC-1 E/Trans-Canada Hwy. Take exit 168 toward Flood Hope Road, turn right onto Flood Hope Road, then right onto the Silver Skagit Road to get to the park. Silver Skagit Road provides access to the park. It is 37 km from Highway #1 to the entrance portal and a further 23 km to Ross Lake Reservoir and the Canada-USA border. Silver Skagit Road is a well maintained, loose surface road that provides access to several active logging areas before the park entrance. Motorists are advised to drive with extreme caution and to use headlights at all times. Watch for wildlife and be aware of logging trucks and other industrial equipment. Extra caution should be taken after rain when road surfaces can become muddy and slippery. ATVs and uninsured vehicles are not permitted on Silver Skagit Road. Note: There are no commercial facilities in the Skagit Valley. No food, lodging, gas or any other goods or services are available. Visitors should be equipped with supplies and fuel before leaving Hope or Silver Creek for Skagit Valley Provincial Park. There is no cell phone service after the first few kilometers of the Silver Skagit Road.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/skagit-valley-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483500,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648,-2147483644]},{"resourceLocationId":-2147483533,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Smelt Bay","fullName":"Smelt Bay Provincial Park","description":"Smelt Bay boasts 24 creatively placed campsites in a wonderful forest setting. Many of the sites are multi-level tiered sites, with privately located tent pads. A beautiful cook shelter is located in the middle of the campground for all park users to share.\n        This park is ideal for tenters and also works well for small RV’s. Larger RV’s will fit in a few of the sites or can camp in the day-use overflow area. Located on the southern peninsula of Cortes Island, the park is named for the capelin fish that spawn ashore by the tens of thousands.\n        Females lay up to 65,000 eggs on the shore in late September and early October, which hatch in 2 to 3 weeks. These small silver-green, sardine-sized fish draw a variety of other marine life to the area, including salmon, seals, sea lions, seabirds and otters. Gulls, Bald eagles, cormorants, herons and oystercatchers can also be seen here.\n        This scenic park features a beautiful pebble beach that extends from the park frontage at the south end of Smelt Bay around the shoreline to Sutil Point. The beach is backed by mounds which are believed to have been built by Coast Salish First Nations as a form of defense. Smelt Bay is the only provincial campground on remote Cortes Island.","drivingDirections":"Smelt Bay is located on the southwest side of Cortes Island, 15 km south of the Whaletown Ferry Terminal on Sutil Point Road. This park is accessible by boat and by car via a ferry from Campbell River on central Vancouver Island to Quadra Island (approx 15 minutes), then by another ferry from Quadra Island (Heriot Bay) to Cortes Island (Whaletown), approximately 45 minutes. Once on Cortes, follow signs to the park. Boaters can reference marine chart 3538 and 3539 for more information about this area.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/smelt-bay-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483495,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648]},{"resourceLocationId":-2147483532,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Sowchea Bay","fullName":"Sowchea Bay Provincial Park","description":"A picturesque park that was formerly a forestry campsite; the campground is along Stuart Lake, with the majority of campsites right next to the water. The park is located only 20 km from Fort St. James.","drivingDirections":"From Prince George travel 100 km west on Highway 16 to Vanderhoof. From Vanderhoof travel 55 km north on Highway 27 to Fort St. James. From Fort St. James travel 20 km west on Sowchea Bay Road.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/sowchea-bay-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483488,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648]},{"resourceLocationId":-2147483531,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Sproat Lake","fullName":"Sproat Lake Provincial Park","description":"Fresh water adventure seekers will not want to miss a visit to Sproat Lake Provincial Park in the Alberni Valley on central Vancouver Island. Located 15 minutes west of Port Alberni, Sproat Lake is a favoured location for swimming, fishing, waterskiing and, when the wind is up, windsurfing. \n\nA variety of short access trails lead visitors around this park, including a trail to the eastern end of Sproat Lake, which is home to one of the finest panels of prehistoric petroglyphs in British Columbia. Little is known about this petroglyph, named K'ak'awin, but it isn't hard to imagine this rock carving as depicting some mystical ancient monsters of the lake.\n\nTwo separate campgrounds and a large day-use area make this park a popular destination for campers and picnickers, who come here to enjoy the host of recreational pursuits available or just relax in the sun by the warm lake.","drivingDirections":"Sproat Lake Provincial Park is located 13 km northwest of Port Alberni on central Vancouver Island. The park sits on the north shore of Sproat Lake, and can be reached via Hwy 4.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/sproat-lake-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483487,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648]},{"resourceLocationId":-2147483530,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Stamp River","fullName":"Stamp River Provincial Park","description":"Relax by the waterfall at this peaceful riverside park or explore the area by foot on hiking trails that weave their way through the lush forest, past waterfalls and river rapids. Named for the pioneer who built Port Alberni's earliest sawmill, this park is an amalgamation of Stamp Falls and Money's Pool provincial parks.\n\nOne of the park's main attractions is the annual run of thousands of Pacific salmon circling in the pool below Stamp Falls before ascending the fish ladders on their way to spawning beds. Lookout points along the river offer excellent views of the salmon fighting their way up the falls and fish ladders. This natural phenomenon occurs every year, starting in late August with sockeye and continuing with coho and Chinook right into December.","drivingDirections":"Stamp River Provincial Park is located northwest of Port Alberni on central Vancouver Island. Follow Hwy 4 past Port Alberni and turn onto Beaver Creek Road. Follow signs to the park.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/stamp-river-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483486,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648]},{"resourceLocationId":-2147483528,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Stemwinder","fullName":"Stemwinder Provincial Park","description":"A small pine-dotted camping area by the Similkameen River   this park is a popular choice for a relaxing picnic. Anglers like to try their luck from the rock-covered shoreline.","drivingDirections":"About 35 km. east of Princeton on Hwy 3, near Hedley.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/stemwinder-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483484,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648]},{"resourceLocationId":-2147483527,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Strathcona","fullName":"Strathcona Provincial Park","description":"Strathcona Provincial Park, designated in 1911, is the oldest provincial park in British Columbia. Located almost in the centre of Vancouver Island, Strathcona park is a rugged mountain wilderness comprising more than 250,000 hectares. Mountain peaks - some perpetually mantled with snow - dominate the park. Lakes and alpine tarns dot a landscape laced with rivers, creeks and streams. Summer in Strathcona is usually pleasantly warm, while winters are fairly mild except for the higher levels, where heavy snowfalls are the norm. From November through March, snowfalls can be expected on the mountain slopes and alpine plateaus. Snow remains all year on the mountain peaks and may linger into July even at moderate elevations. Summer evenings, as elsewhere in the coastal regions of BC, can be cool and rain can be expected at any time of the year.","drivingDirections":"Buttle Lake: The main access to Strathcona Park is via Highway 28, which connects with Gold River on the west coast of Vancouver Island. Follow Hwy 19 north past Courtenay to Campbell River, then follow Hwy 28 west for 48 km. Hwy 28 passes through the northern section of the park and provides access to Buttle Lake. Gas and services are not available between Campbell River and Gold River.\n\n          Forbidden Plateau and Croteau Lake Group Campsite: The main access route to Forbidden Plateau and the Croteau Lake Group Campsite from Courtenay and Campbell River is via the Paradise Meadows Trailhead at Mount Washington. From Highway 19 follow signs to Mount Washington Ski Resort via exit 130 (the Strathcona Parkway) for 20 km. Turn left onto the Nordic Lodge road for 1.5 km to the Paradise Meadows parking lot.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/strathcona-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483483,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648,-2147483644]},{"resourceLocationId":-2147483525,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Summit Lake","fullName":"Summit Lake Provincial Park","description":"This 6 hectare park lies within the Nakusp range of the Selkirk Mountains within the central Kootenay region of BC. Park visitors enjoy canoeing or kayaking, fishing for rainbow and cutthroat trout or swimming in the lake's clear, refreshing mountain water. Mountain goats can often be viewed on rocky outcroppings and in late summer, thousands of western toads emerge from the lake and migrate to the nearby forest to hibernate for the winter.  A variety of ecosystems associated with wetlands and riparian areas are abundant immediately adjacent to the park which offers opportunity to view birds.","drivingDirections":"Located in the southern interior, Summit Lake Park is situated on Hwy 6, 18 kms southeast of Nakusp, a 15-minute drive and 26 km northwest of New Denver, a 20-minute drive.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/summit-lake-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483481,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648,-2147483640]},{"resourceLocationId":-2147483524,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Swan Lake","fullName":"Swan Lake Provincial Park","description":"<p>\n            A small picturesque lakeshore park that offers boating, swimming, a grassy campground and day-use area, baseball diamonds and playground area.<br/>\n            <br/>\n            <strong>Established Date:</strong> June 19, 1918<br/>\n            <strong>Park Size:</strong> 82 hectares<br/>\n            <br/>\n            •History: Established in 1918, it has the distinction of being British Columbia’s third oldest park.<br/>\n            •Conservation: Swan Lake Park provides representation of the Kiskatinaw Plateau ecosection and is covered by the boreal white and black spruce biogeoclimatic zone. Vegetation consists predominately of trembling aspen, balsam poplar, white spruce and willows. Swan Lake is the largest water body in the Alberta plateau. The maximum depth is 7.6 metres and the mean depth is 3.1 metres.<br/>\n            •Wildlife:The occasional moose and white tail or mule deer may pass through the park. However, black bears do frequent the area. Muskrat and beaver can be seen around the lakeshore and the Tupper River which drains into the lake through the park. If you are interested in bird watching, an abundance of waterfowl and migratory bird populations congregate at Swan Lake. An example of birds that frequent Swan Lake include common loon, red-necked grebe, western grebe, trumpeter swan, American widgeon, sandpipers, bufflehead, coot, gulls, eastern kingbird, warblers, blackbirds, killdeer, hooded merganser, red-eyed and warbling vireo, hermit thrush, swallows, yellowlegs, scoters, lesser scaup and goldeneyes, just to name a few. Swan Lake is popular with local anglers. Sport fish include walleye, northern pike, yellow perch and burbot. Northern pike spawn in the spring among lakeshore weeds. Yellow perch, which have been stocked, are also weed spawners, but spawn later in spring. The lake is too shallow and too warm to support cold water salmonid species such as trout and char.<br/>\n          </p>","drivingDirections":"Located 35 kilometres southeast of Dawson Creek, 2 km gravel access off Highway #2.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/swan-lake-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483480,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648,-2147483640]},{"resourceLocationId":-2147483523,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"sw̓iw̓s (Haynes Point)","fullName":"sw̓iw̓s Provincial Park (Haynes Point)","description":"Surrounded by warm water and sandy beaches, sw̓iw̓s (Haynes Point) sits on a pencil of land jutting into Osoyoos Lake. Situated in the rainshadow of the Cascade Mountains to the west and protected from the worst of winter storms by the Columbia Mountains to the east, this is Canada's only true desert area. The water is reported to be the warmest in Canada, making it excellent for swimming, boating and fishing. Lakeside campsites and privacy make this a popular camping area and reservations are necessary during the summer months. Special features: Wetlands are rapidly disappearing in the Okanagan Valley. The marsh area and self-guided interpretive trail are important features of the park.","drivingDirections":"Located two km South of Osoyoos off Hwy 97 onto 32nd Avenue.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/swiws-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483479,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648]},{"resourceLocationId":-2147483521,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Syringa","fullName":"Syringa Provincial Park","description":"Syringa Provincial Park is located in south central BC near the southeast end of the Lower Arrow Lake. The lake is a part of the Columbia River that was widened and deepened with the construction of the Hugh Keenleyside Dam at Castlegar. Recreation opportunities on the Arrow Lake Reservoir have made the park a long time popular destination and offer a comfortable base camp for the family to pursue a variety of recreational pursuits including fishing, boating and swimming. Explore local history and visit the Doukhbour Village Museum and Zukerberg Island located in nearby Castlegar.","drivingDirections":"Located in south central B.C., 19 km northwest of Castlegar on Hwy 3A. Depending on your direction of travel look for the Robson exit just before or after you cross the bridge over the Kootenay River. The park is a 25 minute drive from Castlegar.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/syringa-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483477,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648,-2147483644]},{"resourceLocationId":-2147483637,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Tā Ch’ilā (Boya Lake)","fullName":"Tā Ch’ilā Provincial Park (Boya Lake)","description":"Tā Ch’ilā Provincial Park (Boya Lake) is a 44 site campground situated on the southwest shore of beautiful Boya Lake. Explore the many islands and bays by canoe or kayak. Two hiking trails offer photo opportunities for viewing wildlife, wild flowers, and birds. Visitors can enjoy the hiking trails, the newly constructed playground and picnic shelter and swimming dock. Enjoy the tranquil beauty of this northern wilderness park with its mountain vista and turquoise waters.","drivingDirections":"Tā Ch’ilā Provincial Park (Boya Lake) is located on Highway 37 North, 150 km North of Dease Lake and 90 km South of the Yukon Alaska Highway Junction.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/ta-chila-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483636,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648]},{"resourceLocationId":-2147483520,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Taylor Arm","fullName":"Taylor Arm Provincial Park","description":"The main purpose of Taylor Arm Provincial Park is to provide group camping facilities close to the shores of Sproat Lake. The six group campsites at this park are located across the highway from the lake, connected via a trail that leads through a highway underpass.","drivingDirections":"Taylor Arm Provincial Park is located 23 km northwest of Port Alberni on central Vancouver Island. The park is situated on Hwy 4, approximately 10 km past Sproat Lake Provincial Park.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/taylor-arm-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483476,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483644]},{"resourceLocationId":-2147483519,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Ten Mile Lake","fullName":"Ten Mile Lake Provincial Park","description":"Ten Mile Lake is a very popular recreational destination for local residents and visitors. It offers a large picnic area, three sandy beaches, a boat launch, and great fishing not to mention attractive, treed campsites, showers and flush toilets. A 2-km nature trail to a large beaver pond, through forest and along an abandoned rail road is very rewarding to hike. In the winter the park's trails are transformed into approximately 10 km of cross country ski trails.","drivingDirections":"Approximately 12 km north of Quesnel on Highway 97.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/ten-mile-lake-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483475,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648,-2147483640]},{"resourceLocationId":-2147483518,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Top-Of-The-World","fullName":"Top of the World Provincial Park","description":"<p>There are numerous designated campsites ($5 per person) located at Fish Lake. A new cooking area has been constructed, complete with a Grey water pit, benches, tables, and bear proof storage lockers.</p>\n          <p>There is also a public cabin with a woodstove accommodating 14-18 people; this is available for overnight use, on a first-come, first-served basis (fees of $15 per person or $30 per family are charged). This cabin is not managed by this online registration system at this time. Please bring the correct amount (no change provided) of cash and deposit it in completed self-registration envelop into the self-registration fee vault, located adjacent to the cabin (envelopes located at the fee vault).</p>","drivingDirections":"Top of the World Park is located 48 kilometres northeast of the village of Kimberley, access is via White Swan and Lussier Forest Service Roads, and extreme caution must be exercised at all times while travelling these roads. The access route is normally passable from late May until late October. </p> Via Whiteswan Lake: Turn east off of Highway 93/95, 4.5 kilometres south of Canal Flats. At kilometre 21.3 take the fork to the right (Lussier River Junction). At kilometre 29.6, turn right and cross Coyote Creek. Continue straight at kilometre 30.7, staying on the main road till reaching kilometre 52. The trail begins at this point.</p> National Topographic Series map 82G/14W (Queen Creek) at a scale of 1:50,000 covers the park area. These maps are available from most map retailers in British Columbia.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/top-of-the-world-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483467,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483641]},{"resourceLocationId":-2147483516,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Tweedsmuir South","fullName":"Tweedsmuir Provincial Park   South","description":"<b>Atnarko</b>\n          <li>Atnarko offers 15 campsites nestled amongst an old-growth forest on the Atnarko River at the bottom of “the Hill”.</li>\n          <li>Ranger staff will be at the campground at least once a day during the camping season. The closest store is approximately 60 km away in Hagensborg. There is no cell service or power supply at this campground.</li>\n          <li>There is a water handpump in the campground, but bring your own drinking water or be prepared to treat the surface water, as potable water is not available in the park. There pit toilets on site.</li>\n          <b>Fisheries Pool</b>\n          <li>Fisheries Pool, (situated near Stuie and the site of an old fish hatchery), is a small campground that includes 9 high-density open campsites and 2 tenting campsites. It is popular with anglers and fills up quickly in the fall during the bear viewing season (Sept 1 - Sept 30). It is often difficult for big rigs to turn around when the park is full, and the campsites are best suited for Truck Campers.</li>\n          <li>Ranger staff will be at the campground at least once a day during the camping season. The closest store is approximately 50 km away in Hagensborg.</li>\n          <li>There is a water handpump in the campground, but bring your own drinking water or be prepared to treat the surface water, as potable water is not available in the park.</li>","drivingDirections":"Tweedsmuir South Provincial Park is located on Highway 20, approximately 400 kilometres west of Williams Lake. The highway consists of both gravel and paved sections; travel time is around 6 hours.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/tweedsmuir-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483465,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648,-2147483641]},{"resourceLocationId":-2147483515,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Tyhee Lake","fullName":"Tyhee Lake Provincial Park","description":"Tyhee Lake Provincial Park is situated in the beautiful Bulkley River Valley. To the west are the Telkwa and Bulkley Ranges of the Hazelton Mountains and to the east is the Babine Range of the Skeena Mountains. Back from the 200 m sandy beachfront on Tyhee Lake is a forest consisting primarily of trembling aspen. These trees are second-growth, replacing the original cover that was destroyed by fire 40 to 50 years ago. Visitors may enjoy hiking, walking, swimming, picnicking, bird watching, and nature viewing. Ice fishing and cross-country skiing are popular activities in the winter.","drivingDirections":"1km off highway 16; turn north on the Telkwa high road in Telkwa 10 km east of Smithers.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/tyhee-lake-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483464,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648,-2147483644]},{"resourceLocationId":-2147483514,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Wallace Island Marine","fullName":"Wallace Island Marine Provincial Park","description":"Wilderness, walk-in camping is allowed in the park, which is accessible by boat only. There are 9 sites with tent pads at Chivers Point and 1 site at Cabin Bay   both sites are ideal for kayak camping. Approximately 8 open field sites are available at Conover","drivingDirections":"Wallace Island Marine Provincial Park is only accessible by boat. This park lies in Trincomali Channel between Galiano Island and the northern tip of Saltspring Island, off southern Vancouver Island. Boats can enter the sheltered anchorages at Princess Bay and Conover Cove from Houston Channel. Boaters can reference marine chart #3442 and #3463 for more information on this area. Nearby communities include: Galiano Island, Saltspring Island, Victoria, Nanaimo, Duncan.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/wallace-island-marine-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483458,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483641]},{"resourceLocationId":-2147483513,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Wasa Lake","fullName":"Wasa Lake Provincial Park","description":"A family vacation destination since the 1950's, Wasa Lake village advertises the warmest swimming lake in the Kootenays. Wasa Lake Park offers camping, swimming, hiking, cycling, boating and nature viewing opportunities. There is an 8 km wheelchair and bike accessible trail around the lakeshore and a 2.7 km self-guided interpretation trail.\n\nWorld class attractions such as Fort Steele Heritage town, guest ranches, ski hills and golf courses are nearby. In addition to being a popular recreation spot, the park protects a representative grassland ecosystem. It includes a portion of North America's most northern ponderosa pine forest set amid blue bunch wheatgrass meadows that provide habitat for a wide diversity of animals and plants.","drivingDirections":"Located in south eastern British Columbia, 40 km north of Cranbrook or 102 km south of Radium Hot Springs and 1 km east of Highway 93 and 95. The closest communities are Kimberley located 35 km north west and Cranbrook located 40 km south of Wasa Lake.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/wasa-lake-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483457,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648]},{"resourceLocationId":-2147483512,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Wells Gray","fullName":"Wells Gray Provincial Park","description":"A quiet destination campground for families and for fishing - on the western end of Mahood Lake, the only lake in Wells Gray that isn't glacier fed and so it warms up enough for pleasant swimming! For the angler, the lake holds Kokanee, whitefish, burbot, Rainbow and lake trout. For anglers who want more excitement than lake trolling, the Canim and Mahood rivers, as well as several creeks, offer a multitude of opportunities for fly-casters. For visitors who just want to relax, there are several hundred metres of beach and a shelving foreshore which invites swimming, wading and sunbathing.","drivingDirections":"<br/><b>Mahood Lake: </b>At the south-western tip of Wells Gray Park, accessed either via 88 km of paved and gravel roads from 100 Mile House and along the south shore of Canim Lake, or via 65 km of gravel road from the Interlakes corner on Hwy 24, or across TFL 18 via logging roads from Clearwater.\n\t\t\t  The nearest communities to this park are 100 Mile House, Lone Butte, Interlakes, Bridge Lake, Hathaway Lake, Forest Grove, Canim Lake and Sheridan Lake. <br/>\n\t\t\t  <b>Falls Creek and Clearwater Lake: </b>This campground is located near the south end of Wells gray park. Turn off Highway 5 and the Clearwater Info centre and proceed 67 kms north on the Clearwater Valley road.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/wells-gray-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483456,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648,-2147483644,-2147483641]},{"resourceLocationId":-2147483509,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Whiskers Point","fullName":"Whiskers Point","description":"<p>Whiskers Point Provincial Park offers camping along the historic McLeod Lake. This quiet, forested park creates a secluded and sheltered southern exposure offering magnificent sunsets over the lake. </p>\n        <p>A playing field, horseshoe pits, adventure playground and volleyball net provide something for every member of the family. Swimming, fishing and hiking are also popular in this 116 hectare park that features a beautiful sandy beach along the cool sub-boreal spruce forest.</p>","drivingDirections":"Located 130 km north of Prince George on Highway 97. Communities close to this park include Mackenzie, Mcleod Lake, Bear Lake and Prince George.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/whiskers-point-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483445,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648]},{"resourceLocationId":-2147483508,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Whiteswan Lake","fullName":"Whiteswan Lake Provincial Park","description":"Cave Creek Campground: trail access from Alces Lake or Home Basin campgrounds; water access from boat launches at Packrat Point and Home Basin campgrounds. There are six (6) backcountry campsites with tent pads, identified on the campground map as follows: PAD1, PAD2, PAD3, PAD4, PAD5 and PAD6. There are a total of two (2) pit toilets and two (2) food lockers onsite, generally found on both ends of the campground. There are also several picnic tables and fire rings spread throughout the campground.","drivingDirections":"Whiteswan Lake Provincial Park is located within the Kootenay Ranges of the Rocky Mountains, 22km southeast of the Village of Canal Flats, the nearest community. Access is from Highway 93/95, turn east 4.5 kilometres south of Canal Flats onto the gravel Whiteswan Forest Service Road. Whiteswan Lake is about 25 km from the highway; the hot springs are located near the west boundary of the park at kilometre 17.5.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/whiteswan-lake-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483444,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483641]},{"resourceLocationId":-2147483500,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Yahk","fullName":"Yahk Provincial Park","description":"<p>Located along Highway 3/95, 70km south of Cranbrook and 14.5km north of the US and Canadian borders at Kingsgate, Yahk Park is a traveller’s rest place. Near the Moyie River in a quiet well spaced forest this 26 site campground and day-use area is a great introduction to BC Park visitor facilities.</p>\r\n\r\n<p>Yahk Park was established in 1956 to provide camping and picnicking opportunities for the travelling public. As well it conserves a short scenic section of the Moyie River. The adjacent town of Yahk has services and tourist supplies. The area was once a major supplier of railroad ties for the Canadian Pacific Railway.</p>","drivingDirections":"Yahk Provincial Park is located along Highway 3/95, 70km south of Cranbrook, 14.5km north of the U.S. and Canadian borders at Kingsgate. Yahk Park is located on the south edge of the small community of Yahk.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/yahk-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483436,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648]},{"resourceLocationId":-2147483642,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Berg Lake Trail","fullName":"Berg Lake Trail","description":"The Berg Lake Trail remains closed for hiking above Kinney Lake campground. While the Berg Lake Trail remains closed, the revitalized campground at Kinney Lake offers the perfect chance to explore a unique backcountry opportunity ideal for the beginner backpacker or families with young kids. Kinney Lake campground has stunning views, a picnic shelter, and an easy compact trail.","drivingDirections":"The park is located in east, central British Columbia, just west of the British Columbia/Alberta border and Jasper National Park. Approximately 4 hours north of Kamloops, BC on Highway 5; 3 1/2 hours east of Prince George, BC on Highway 16; and 5 hours west of Edmonton, Alberta on Highway 16. The closest communities to this park are Valemount, Tete Jaune Cache and McBride.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/parks/mt-robson/berg-lake-trail/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483641,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483642]},{"resourceLocationId":-2147483627,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Chilliwack Lake","fullName":"S⨱ótsaqel / Chilliwack Lake Provincial Park","description":"Located 150 km east of Vancouver in the upper Chilliwack River Valley, S⨱ótsaqel / Chilliwack Lake Provincial Park is characterized by a valley-bottom lake, old-growth forested slopes, and spectacular subalpine and alpine ridges. The sparkling Chilliwack Lake is ideal for motor-boating, canoeing, kayaking, swimming, or fishing. Forty kilometres of trails provide opportunities for hiking, bird and wildlife viewing, and nature appreciation. The park also has a playground, and 146 frontcountry campsites. Those seeking a wilderness camping experience can access the backcountry camps located at Greendrop, Lindeman, Flora, and Radium Lakes.","drivingDirections":"The park is located 64 km southeast of Chilliwack, 40 km in from Vedder Crossing. Take Exit 104 from Highway 1 and follow the signs for Cultus Lake until Cultus Lake Road. Instead of turning here, follow Vedder Road across the bridge and turn right onto Chilliwack Lake Road. Follow this road for 40 km to the lake","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/sxotsaqel-chilliwack-lake-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483621,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648,-2147483641]},{"resourceLocationId":-2147483609,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Garibaldi","fullName":"Garibaldi Provincial Park","description":"<p>Garibaldi Park is located in the Coast Mountains 70 kms north of Vancouver, close to Squamish. Overnight campers should be prepared to be self-sufficient and practice backcountry ethics.</p>\r\n<p>Reservations are required year-round for all areas and must be made before heading into the park. Proof of payment must be carried at all times when camping overnight in these areas. Please display your permit (confirmation letter) at each tent pad(s) or bunk(s).</p>\n\t\t\t\t\t<p><b>Backcountry reservations</b>: backcountry camping is permitted in designated campsites only. These camping facilities are in the following areas:</p>\n\t\t\t\t\t<ul>\n\t\t\t\t\t<li>Diamond Head / Elfin Lakes / Rampart Ponds</li>\n\t\t\t\t\t<li>Garibaldi Lake / Taylor Meadows / Helm Creek</li>\n\t\t\t\t\t<li>Cheakamus Lake / Singing Creek</li>\n\t\t\t\t\t<li>Singing Pass / Russet Lake</li>\n\t\t\t\t\t<li>Wedgemount Lake</li>\n\t\t\t\t\t</ul>\n\t\t\t\t\t<p><b>Elfin Lakes Shelter reservations</b>: To purchase an overnight stay at the Elfin Shelter, please select the \"Elfin Shelter\" option and the number of persons. Up to six people can reserve a spot in the shelter in one reservation and each person will have access to one spot in the shelter on which to sleep. The shelter has bunks for 33 people (11 double bunks, 11 single bunks) and bunk assignment is first-come, first-served upon arrival the shelter. </p>\n          <p><b>Wilderness Reservations</b>: wilderness camping is available for mountaineers, climbers, ski tourers, and other visitors with advanced skills in wilderness travel and camping. Users who meet these criteria can select the wilderness camping option. These reservations are only valid in the designated wilderness camping area. Winter routes to Elfin, even the marked winter route, has exposure to avalanche terrain.</p>","drivingDirections":"Five park access points are located along Highway 99, Sea to Sky Highway, between Squamish and Pemberton. Vehicle access is recommended as the five trailheads are located anywhere from 2 km to 16 km off Highway 99.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/garibaldi-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483602,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483642,-2147483639,-2147483637]},{"resourceLocationId":-2147483606,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Golden Ears","fullName":"Golden Ears Provincial Park","description":"As one of the largest parks in the province, Golden Ears Provincial Park is prized for its recreational opportunities. The extensive system of trails within the park provides an excellent opportunity for hiking and horseback riding. Alouette Lake is a popular spot for swimming, windsurfing, water-skiing, canoeing, boating and fishing. The park also has three large campgrounds. Vegetation is typical of the coastal western Hemlock forest of BC and the mountainous backcountry is extremely rugged.","drivingDirections":"Golden Ears Provincial Park lies in the Coast Mountains 11 km north of Maple Ridge on the north side of the Fraser River. Access to the park is by vehicle via Dewdney Trunk Road through the Municipality of Maple Ridge. If heading west, turn right onto 232nd and if heading east, turn left onto 232nd. Take the first exit at the roundabout onto 132 Avenue; then keep right onto Fern Crescent and follow the road to the park entrance. Vehicle access to group campgrounds or trailheads will not be available if the road is closed due to hazardous conditions in the winter.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/golden-ears-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483599,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648,-2147483644]},{"resourceLocationId":-2147483625,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Cowichan River","fullName":"Cowichan River Provincial Park","description":"If it’s outdoor recreation you’re after, Cowichan River Park on southern Vancouver Island is the place to go. Whether you want to go swimming, canoeing, white-water kayaking, camping, fishing, hiking, or just want to take it easy in the sun, you’re bound to find something to do in this “recreation corridor” south of Duncan.","drivingDirections":"There are three main access points to this Cowichan River Provincial Park:\n          Skutz Falls Road/West Access: Located off Highway 18, Skutz Falls Road provides access to Skutz Falls Day-Use area, Horseshoe Bend Group Campsite, Marie Canyon Day-Use area and the Skutz Falls Trailhead of the Cowichan River Trail. Follow signs from Skutz Falls Road via Cowichan Lake Road and Mayo Road to Riverbottom Road.\n          Highway 18 Connector/Middle Access: Located off Highway 18, the Highway 18 Connector provides access to the Stoltz Pool Campground, Group Campsite and Day-Use areas. Follow signs to Riverbottom Road.\n          Robertson Road/South East Access: Located on Robertson Road in the Glenora area south of Duncan. To access this point proceed west on Glenora Road, turn right onto Vaux Road and continue down Vaux Road, as it leads into Robertson Road. This provides access to the Glenora Trailhead of the Cowichan River Trail.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/cowichan-river-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483619,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648,-2147483644]},{"resourceLocationId":-2147483506,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Golden Ears Backcountry","fullName":"Golden Ears Backcountry","description":"As one of the largest parks in the province, Golden Ears Provincial Park is prized for its recreational opportunities. The extensive system of trails within the park provides an excellent opportunity for hiking and horseback riding. Alouette Lake is a popular spot for swimming, windsurfing, water-skiing, canoeing, boating and fishing. The park also has three large campgrounds. Vegetation is typical of the coastal western Hemlock forest of BC and the mountainous backcountry is extremely rugged.","drivingDirections":"Golden Ears Provincial Park lies in the Coast Mountains 11 km north of Maple Ridge on the north side of the Fraser River. Access to the park is by vehicle via Dewdney Trunk Road through the Municipality of Maple Ridge. If heading west, turn right onto 232nd and if heading east, turn left onto 232nd; then turn right onto Fern Crescent and follow road into park. The closest communities, towns and cities are Maple Ridge, Mission and Pitt Meadows.\n          <br/>\n          <br/>Vehicle access to group campgrounds or trailheads will not be available if the road is closed due to hazardous conditions in the winter.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/golden-ears-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483442,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483641]},{"resourceLocationId":-2147483618,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"E. C. Manning","fullName":"E. C. Manning Provincial Park","description":"<p>E.C. Manning Park is located in the heart of the Cascade Mountains, within a three-hour drive of both the Lower Mainland and the Okanagan. There are 16 backcountry campgrounds in E.C. Manning Park, all with a variety of amenities. Backcountry campgrounds require a backcountry registration. To complete a backcountry registration, proceed through the booking flow and complete your registration. Buckhorn backcountry campground on the Heather Trail requires a backcountry reservation from the Canada Day weekend to Labour Day. To make a backcountry reservation at Buckhorn campground, select \"backcountry reservation\" from the tab above and complete a reservation transaction.</p>","drivingDirections":"Bisected by Hwy 3, the park stretches for 58 km from portal to portal. The western portal, marked by the carving of a marmot, is 26 km east of Hope and the eastern portal, marked by a carving of a bear, is 52 km west of Princeton. The core area of the park is located 68 km east of Hope and 68 km west of Princeton.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/ec-manning-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483611,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648,-2147483644,-2147483642,-2147483641]},{"resourceLocationId":-2147483587,"timeZoneOffset":-420.0,"similarExperiences":[],"localizedValues":[{"cultureName":"en-CA","shortName":"Kootenay Lake","fullName":"Kootenay Lake Provincial Park","description":"<p>Lost Ledge is a small, secluded campground with 14 first-come, first-served camp sites situated on the north-western shore of Kootenay Lake, 25km north of Kaslo on Hwy 31 and 5km south from Davis Creek campground. Lost Ledge is known for outstanding views of the Purcell mountain range and lake view sheltered campsites. It is popular with anglers and is equipped with a concrete boat launch and parking for boat trailers.</p>","drivingDirections":"Davis Creek / Lost Ledge sites are located in south central BC, on Highway 31 adjacent to Kootenay Lake. Both sites are north of Kaslo   Lost Ledge 25 km and Davis Creek 30 km. The driving time to Kaslo is 30 minutes. Midge Creek site is located 38 km south of Balfour, on the southwest shore of Kootenay Lake across from Sanca Creek.","confirmationLetterPolicies":[]}],"email":"","website":"https://bcparks.ca/kootenay-lake-park/","faxNumber":"","gpsCoordinates":"","googleAddress":null,"streetAddress":"","city":"","region":null,"regionCode":"","country":null,"phoneNumber":"","transactionLocationId":-2147483572,"selfCheckInInstructions":[],"attributes":[],"resourceCategoryIds":[-2147483648,-2147483644]}